package com.example.user1.taro;

import java.util.Calendar;
import android.graphics.Bitmap;
import android.graphics.BitmapFactory;
import android.graphics.Canvas;
import android.graphics.Paint;
import android.graphics.drawable.BitmapDrawable;
import android.os.Bundle;
import android.support.v7.app.AppCompatActivity;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ArrayAdapter;
import android.widget.Button;
import android.widget.EditText;
import android.widget.ImageView;
import android.widget.Spinner;
import android.widget.TextView;
import android.widget.Toast;

public class MainActivity extends AppCompatActivity {
    EditText name;
    EditText birthyear;
    EditText birthmonth;
    EditText birthday;
    EditText calendar_year;
    private Spinner spinner;
    private Spinner spinner2;

    private static final char[] CHO ={
            0x3131, 0x3132, 0x3134, 0x3137, 0x3138, 0x3139, 0x3141,
            0x3142, 0x3143, 0x3145, 0x3146, 0x3147, 0x3148,
            0x3149, 0x314a, 0x314b, 0x314c, 0x314d, 0x314e};

    private static final char[] JUN ={
            0x314f, 0x3150, 0x3151, 0x3152, 0x3153, 0x3154, 0x3155,
            0x3156, 0x3157, 0x3158, 0x3159, 0x315a, 0x315b,
            0x315c, 0x315d, 0x315e, 0x315f, 0x3160, 0x3161,
            0x3162, 0x3163};

    private static final char[] JON ={
            0x0000, 0x3131, 0x3132, 0x3133, 0x3134, 0x3135, 0x3136,
            0x3137, 0x3139, 0x313a, 0x313b, 0x313c, 0x313d,
            0x313e, 0x313f, 0x3140, 0x3141, 0x3142, 0x3144,
            0x3145, 0x3146, 0x3147, 0x3148, 0x314a, 0x314b,
            0x314c, 0x314d, 0x314e};

    //타로 카드 설명
    String taro_1="\n▶마법사\n\n" +
            "▶발명가, 세일즈맨, 치유사, 자영업자, 여성대상서비스업, 의사, 연구개발\n" +
            "　동시 통역, 기술자, 마술사\n\n" +
            "―재주가 많고 독창적⋅창조적이며 상상력과 아이디어가 뛰어나다. \n\n" +
            "―언변이 뛰어나고 자신감이 넘치는 매력적인 사람이다.\n\n" +
            "―치유의 능력을 가지고 있기도 하다.\n";

    String taro_2="\n▶여사제\n\n" +
            "▶교육자, 보모, 상담사, 종교가, 점술가, 타로마스터, 간호사\n" +
            "　책 관련업, 연구직\n\n" +
            "―지혜롭고 객관적이며 현명하게 상황판단을 잘한다. \n\n" +
            "―통찰력 있고 직관적으로 행동한다. \n\n" +
            "―사람의 심리와 무의식의 세계를 잘 이해하며 자신의 속내를\n" +
            "　잘 드러내지 않는다.\n";

    String taro_3="\n▶여황제\n\n" +
            "▶금융업, 주부, 가내수공업, 텔레마케터, 작가, 미용, 전원 관련사업\n" +
            "　성공한 여성\n\n" +
            "―따뜻하고 넉넉하며 자신의 것을 잘 나누는 모성애적 여성성이 두드러진다. \n\n" +
            "―다른 사람을 돌보고 그들이 잘 성장할 수 있도록 돕고자 하는\n\n" +
            "　욕구가 있으며, 인정을 받기를 원한다.\n\n" +
            "―현실적이며 성취 지향적⋅실용적이다.\n\n" +
            "―아름다움과 미적인 감각이 있다.\n";

    String taro_4="\n▶황제\n\n" +
            "▶건축가, 부동산, 정치인, 공무원, 고위간부, 경영자, 무역업\n\n" +
            "―가장의 표상이며, 세속적 힘을 갖길 원하고 자기 확신과 불굴의 정신\n" +
            "　호전적이다.\n\n" +
            "―책임감이 강하고 통제적이며 권력 지향적이다. \n\n" +
            "―현실적 안정을 추구하고 이성적 판단을 중시하며 고정관념이 강하다.\n\n" +
            "―릴렉스하는 방법을 찾아야한다.\n";

    String taro_5="\n▶교황\n\n" +
            "▶종교철학, 사제나 신부, 전문적 컨설턴트, 인수합병전문가, 교육자\n" +
            "　출판사, 중개인, 멘토 \n\n" +
            "―진리를 가르치는 일에 관심이 있는 교육자의 상징이다.\n\n" +
            "―자비롭고 친절하며 전통을 중요하게 생각하고 보수적이다.\n\n" +
            "―종교적 이념이나 더 높은 도덕을 지향한다.\n\n" +
            "―다른 사람의 고민을 해결해 주려하는 경향이 많다.\n";

    String taro_6="\n▶연인\n\n" +
            "▶대인서비스직종, 예술가, 네트워크사업가, 연예코치, 결혼소개업\n" +
            "　사회사업가, 자선 사업가, 패션, 헤어 디자이너, 모델\n\n" +
            "―인간관계가 중요한 사람이며 공동 작업이나 그룹 활동을 좋아한다.\n\n" +
            "―사랑과 미에 대한 관심이 높고 자신을 아름답게 잘 꾸민다. \n\n" +
            "―정서적으로 깊은 감정을 교류하고 싶어 한다.\n";

    String taro_7="\n▶전차\n\n" +
            "▶군인, 경찰, 아나운서, 강사, 전문직종사자, 여행사, 출판, 유통업\n" +
            "　홍보, 외교관, 운전사\n\n" +
            "―목표를 위해 역경을 극복하려는 강한 추진력과 의지가 있다.\n\n" +
            "―당돌하며 독립적이며 역마살이 있기도 하다.\n\n" +
            "―여러 가지 일에 동시에 관심을 가진다.\n\n" +
            "―성공을 위해 선 상충되는 부분을 잘 조율해야한다.\n";

    String taro_8="\n▶힘\n\n" +
            "▶조련사, 교육자, 트레이너, 감독관, 운동선수, 치과의사, 수의사\n" +
            "　미용, 정치인, 애완동물관련업, VIP를 다루는 직업.\n\n" +
            "―위험을 두려워하지 않고 정면승부한다.\n\n" +
            "―인내심이 있으며 관리능력이 뛰어나다.\n\n" +
            "―내적인 용기와 자기 확신과 도전적인 성향\n\n" +
            "―내면의 두려움과 맞서야 할 과제를 안고 있다.\n";

    String taro_9="\n▶은둔자\n\n" +
            "▶의사, 교수, 수도승, 사색가, 철학가, 기공사, 천문학자\n" +
            "　특정분야의 전문가, 멘토, 웰빙전문가, 석박사 대학원생\n\n" +
            "―혼자 있기를 좋아하고 관심이 내면에 있는 사람이다. \n\n" +
            "―사려 깊고 신중하며, 다른 사람에게 조언하기를 좋아한다. \n\n" +
            "―외골수이며 자신만의 세상이 강하다.\n";

    String taro_10="\n▶운명의 수레바퀴\n\n" +
            "▶운송업, 파트타임, 영화영상, 투자가, 기계공학, 엔터테인먼트 사업\n" +
            "　생명공학, 자동차공학, 천문가, 재활관련업\n\n" +
            "―재주 있는 사람이다. \n\n" +
            "―카르마적 사람이다.\n\n" +
            "―진리라고 생각하는 분야를 배워서 타인에게 가르치거나 혹은\n" +
            "　공공의 이익을 위해 사용할 필요하다.\n\n" +
            "―삶의 변화가 많을 수 있다.\n";

    String taro_11="\n▶정의\n\n" +
            "▶법조인, 중개인, 에이전시, 분석. 평가와 감정, 에이전시, 임상병리\n" +
            "　회계사, 세무사\n\n" +
            "―주고받는 것이 정확하며 이성적이고 분별심이 있다.\n\n" +
            "―공정하고 합리적인 일처리를 선호한다.\n\n" +
            "―적당한 균형과 조화를 이루고자 한다.\n\n" +
            "―대인관계 시 감성적인 면 부족할 수도 있다.\n";

    String taro_12="\n▶매달린 사람\n\n" +
            "▶심리학자, 정신과전문의, 사회봉사가, 혁명가, 의료관련종사자, 요가\n" +
            "　명상, 체조, 밤낮이 바뀐 직업\n\n" +
            "―개성이 뚜렷하고 세상을 보는 시각이 남들과 다르다.\n\n" +
            "―사유가 깊고 말과 행동이 다른 사람에 비해 느리다.\n\n" +
            "―희생과 헌신의 가치를 안다.\n\n" +
            "―자신의 생각에 사로잡힐 수도 있다.\n";

    String taro_13="\n▶죽음\n\n" +
            "▶경찰, 군인, 외과의사, 장의사, 법률기관, 죽음과 관련된 직업\n" +
            "　병원, 공항검색요원\n\n" +
            "―고통을 애벌레가 나비가 되는 과정으로 인식한다.\n\n" +
            "―변화를 두려워하지 않는 힘 있는 사람이다.\n\n" +
            "―7전8기의 정신력을 가졌다.\n";

    String taro_14="\n▶절제\n\n" +
            "▶통신회사, 외환딜러, 항공기 승무원, 해운업, 텔레마케트, 커플매니저\n" +
            "　펀드매니저, 약재상, 제약회사, 중재자, 꽃꽂이\n\n" +
            "―절제하고 인내할 줄 아는 사려 깊은 사람이다. \n\n" +
            "―자기 통제와 검소한 태도를 통해 목표를 달성한다. \n\n" +
            "―유연하고 융통성이 있다.\n ";

    String taro_15="\n▶악마\n\n" +
            "▶사채업, 브로커, 마술사, 서커스, 사교계, 유흥관련 종사자, 성과위주영업\n" +
            "　경마, 교도관, 24시간 일하는 곳, 정신병원관계자, 직장인\n\n" +
            "―매우 현실적이며 물질적인 강인한 사람이다. \n\n" +
            "―의리가 있고 명예욕이 있다.\n\n" +
            "―오감을 즐긴다.\n\n" +
            "―자신의 관심 분야에 무서우리 만치 집중한다. 관계에 집착할 수 있다.\n";

    String taro_16="\n▶탑\n\n" +
            "▶성형외과, 부동산업, 우주항공, 게임, 소방공무원, 스턴트맨\n" +
            "　건설현장, 군사 과학, 영적인 지도자, 재건축업, 에너지, 화력\n" +
            "　원자력 종사자, 주유소, \n\n" +
            "―진실을 갑작스럽게 인식하고 그 진실과 맞지 않을 경우에 자신이 가진 것을\n" +
            "　모두 버릴 수 있는 과감한 면이 있다. \n\n" +
            "―도전과 변화를 추구한다.\n\n" +
            "―자만심을 경계해야 한다.\n";

    String taro_17="\n▶별\n\n" +
            "▶예술가, 연예인, 인기 강사, 디자이너(보석, 미용, 헤어, 의상)\n" +
            "　조경사, 방송인, 창작관련, 사우나, 녹색운동, 직업에서 TOP이 되는\n\n" +
            "―어둠 속에서 희망의 등불이 되려는 사람이다. \n\n" +
            "―낙천적이며 긍정적인 사고를 가진 인기 있는 사람이다.\n\n" +
            "―늘 미래에 대한 희망을 가지고 있다.-구체적 행동이 필요.\n";

    String taro_18="\n▶달\n\n" +
            "▶집안일, 건축, 점성가, 요식업, 수사관, 명상가, 천문학자, 주말농장\n" +
            "　심리치료사, 해양전문가, 동물수의사, 명상가, 최면술사, 역사학자\n\n" +
            "―예민하고 섬세한 감성적인 사람이다.\n\n" +
            "―꿈과 직관이 뛰어나다.\n\n" +
            "―불안과 걱정이 많다-내적 안정을 찾고 인생을 즐겨라.\n";

    String taro_19="\n▶태양\n\n" +
            "▶증권, 출판업, 육아사업, 동업, 운동선수, 카피라이터, 경마\n" +
            "　태양열 사업관련, 소아과의사, 고아원, 아동심리학자\n" +
            "　여름이나 낮에 관련된 일\n\n" +
            "―어린아이와 같이 순수한 사람하며 자신감과 열정이 넘친다.\n\n" +
            "―자신의 역량보다 더 큰 일을 해내는 용기와 믿음이 있다.\n\n" +
            "―주변의 지지와 보살핌에 대한 감사한 마음을 내는 것이 필요하다.\n";

    String taro_20="\n▶부활\n\n" +
            "▶저널리스트, 고고학자, 아나운서, 성우, 음반, 공연, 이벤트\n" +
            "　목욕관련, 적십자등 의료단체, 대체의학, 최면, 치유사\n" +
            "　메시지를 전달하는 사람, 제사용품\n\n" +
            "―옳고 그름에 대한 판단이 바르고 정의로운 사람이다. \n\n" +
            "―옳은 일을 위해서 기꺼이 희생 한다.\n\n" +
            "―억울하거나 불쌍한 사람을 보면 적극 개입해서 도와준다.\n\n" +
            "―기적을 믿고 예언능력이 높으며 공적인 삶을 산다.\n";

    String taro_21="\n▶세계\n\n" +
            "▶장식업계, 외국계회사, 패션업계, 동시통역, 홍보회사\n" +
            "　유엔기구, 스타일리스트, 스튜어디어스, 비행사, 무역\n\n" +
            "―어떠한 환경에서도 완성을 이루려는 완벽주의적 경향이 있다.\n\n" +
            "―세상에 나와 자신의 능력을 발휘하고 싶어 한다.\n\n" +
            "―시야가 넓고 전체를 본다.\n\n" +
            "―주변에 인덕이 있으며 예술적 성향이 강하다.\n";

    String taro_22="\n▶바보\n\n"+
            "▶여행가이드, 예술가, 탐험가, 등반가, 프리랜서, 자퇴자, 계약직\n\n"+
            "―자유로운 영혼의 소유자다.\n\n"+
            "―순수하며 단순⋅소박하다.\n\n"+
            "―때로는 자기중심적이다라는 평을 듣기도하지만 하나에 빠지면\n" +
            "　열정적으로 몰입한다.\n\n"+
            "―정신세계에 뜻을 두기도 한다.\n";

    //영혼수

    String what_1="\n자기 정체성을 확립하고 자아를 개발해 리더가 되어야 한다. 홀로서기를 통해 리더로서 역량을 키워라. 의식의 마법은 당신의 삶을 바꿀 수 있는 힘과 에너지를 준다.\n";

    String what_2="\n평화중재자로서 균형을 이루고 협동하며 조직의 일원으로서 사람들과 함께 할 것이다. 일상적 삶이 주는 단서에 마음을 열고 수용한다면 직관이 당신이 원하는 것을 얻게 할 것이다.\n";

    String what_3="\n낙관주의와 열정을 통해 사람들에게 즐거움을 전파시켜라. 타고난 재능인 언어의 유희와 재치로 경쾌하게 자신을 표현하라. 당신이 가진 모든 것을 길러라.\n";

    String what_4="\n집중된 의지를 통해 가슴속의 욕망을 찾아내고 그것을 실현시키기 위한 조건들을 찾아내어 내 삶의 기반을 만들어 나가야 할 것이다.\n";

    String what_5="\n시간을 가지고 자신의 영적자아와 접속하라. 자유를 추구하고 변화와 진보가 사명이다. 머무르지 말라.\n";

    String what_6="\n봉사와 돌봄, 사랑이 자신의 나아갈 길이다. 다른 사람들에게 안락함을 주는 것을 통해 배울 것이다. 주변을 사랑과 미로 채워라.\n";

    String what_7="\n깊이 있는 분석과 탐구를 통해 내면의 지혜들을 알아내어 완성해 나갈 것이다. 세상을 계몽하는 일을 하는 전문가가 되어 자신의 지혜를 가르쳐라.\n";

    String what_8="\n자신의 권위를 표현하고 자신의 저력을 발견하며 직관에 귀 기울여 자신이 원하는 것을 실현시켜 나가야 할 것이다. 성공과 성취가 함께 할 것이다.\n";

    String what_9="\n관용과 용서, 치유기술을 통해 무조건적인 온전한 사랑을 베풀어야 할 것이다. 배우며 동시에 가르치는 삶을 살기 위해 내면을 향해야 한다.\n";



    //별자리
    String star_1="\n▶양자리(3월 21일 ~ 4월 19일)\n" +
            "\n▶정의감이 남다른 양자리는 뜨거운 열정과\n" +
            "     자신감을 가지고 있는데, 자신만의 신념이 있으며\n" +
            "     그 신념이 아주아주 강합니다.\n" +
            "     하지만 양자리는 불 같은 성격으로 인해\n" +
            "     비난을 받기도 하지만\n" +
            "     천진난만함이 있기 때문에 화가 오래 가지는 않습니다.\n" +
            "\n▶장점\n" +
            "     리더쉽과 카리스마가 있다.\n" +
            "     외향적이고 유머감각이 있다.\n" +
            "     다른 사람을 훌륭하게 도와 그들의 꿈을 이루게 해준다.\n" +
            "     도전을 받아들인다.\n" +
            "     책임감이 강하다.\n" +
            "     자긍심이 높다.\n" +
            "     직감이 발달\n" +
            "     타인을 위해 위험을 무릅쓴다.\n" +
            "     약자를 보호한다\n" +
            "     명확하다.\n" +
            "     성욕이 왕성하다.\n" +
            "     사랑하는 사람을 위해 목숨도 바친다.\n" +
            "     모두가 포기할지라도 자신만은 포기 하지 않는다.\n" +
            "\n▶단점\n" +
            "     최고가 아니면 못산다.\n" +
            "     성급하다.\n" +
            "     다른사람에게 미치는 영향을 고려하지 않는다.\n" +
            "     참을성이 부족하다.\n" +
            "     지배적이다.\n" +
            "     이기적이다.\n" +
            "     충동적이다.\n" +
            "     직선적이다.\n" +
            "\n▶인체\n" +
            "     머리, 얼굴 윗부분, 뇌하수체\n" +
            "\n▶직업\n" +
            "     불, 칼, 금속류 취급(군인, 스포츠, 기자, 엔지니어)";

    String star_2="\n▶황소자리(4월 20일 ~ 5월 20일)\n" +
            "\n▶실용성, 현실성이 있는 황소자리는 \n" +
            "     오감이 발달한 사람들이 많습니다.\n" +
            "     또한 신중하고 느긋함을 가지고 있는데\n" +
            "     이런 성격 때문에 밖으로 나가는 것보다는\n" +
            "     집에서 노는 것을 좋아하는 사람이 많습니다.\n" +
            "\n▶장점\n" +
            "     주의와 사려가 깊다.\n" +
            "     믿음직스럽다.\n" +
            "     우아하고 예술적이다.\n" +
            "     다른 사람의 말을 잘 들어준다.\n" +
            "     친절하고 관대하다.\n" +
            "     자연을 사랑한다.\n" +
            "     젠틀하다.\n" +
            "     시간관념 철저하다.\n" +
            "     실용적이다.\n" +
            "     감각이 예민하다.\n" +
            "\n▶단점\n" +
            "     질투심이 많다.\n" +
            "     완고하고 고집부린다.\n" +
            "     물질만능주의이다.\n" +
            "     행동이 굼뜨다.\n" +
            "     말을 잘 안한다.\n" +
            "     생각을 너무 많이해서 행동이 미뤄진다.\n" +
            "     지루하고 둔감하다.\n" +
            "     게으르다.\n" +
            "     소유욕이 강하다.\n" +
            "\n▶인체\n" +
            "     얼굴아랫 부분, 목, 인후, 성대, 갑상선\n" +
            "\n▶직업\n" +
            "     귀중품, 재정, 금융, 회계, 부동산, 농업\n" +
            "     원예, 요리, 성악, 건축, 실내장식";

    String star_3="\n▶쌍둥이자리(5월 21일 ~ 6월 21일)\n" +
            "\n▶소통하기를 좋아하는 쌍둥이자리는 유머감각이 있고\n" +
            "     예리하지만 인내심이 부족할 수 있어\n" +
            "     낡은 것보다는 새로운 것을 좋아하며\n" +
            "     순간적인 대체능력이 좋고\n" +
            "     호기심이 많은 성격을 가지고 있습니다.\n" +
            "\n▶장점\n" +
            "     호기심이 왕성하다.\n" +
            "     재미있는 성격이다.\n" +
            "     유쾌하다.\n" +
            "     매력적이다.\n" +
            "     다재다능하다.\n" +
            "     생기가 넘친다.\n" +
            "     행동이 빠르다.\n" +
            "     선입견이 없다.\n" +
            "     영리하고 지적이다.\n" +
            "     늘 젊음을 간직한다.\n" +
            "\n▶단점\n" +
            "     침착하지 못하다.\n" +
            "     싫증을 잘 낸다.\n" +
            "     비실용적인 면이 있다.\n" +
            "     변덕쟁이이다.\n" +
            "     무책임하다.\n" +
            "     수다스럽다.\n" +
            "\n▶인체\n" +
            "     어깨, 팔, 손, 흉선, 허파\n" +
            "\n▶직업\n" +
            "     통역, 운수업, 커뮤니케이션, 교사, 상업일반, 세일즈광고\n" +
            "     출판, 통신\n";

    String star_4="\n▶게자리(6월 22일 ~ 7월 22일)\n" +
            "\n▶가정적인 성격을 가진 게자리는 차분한 성격으로\n" +
            "     주변사람들이 좋아하며 공감능력이 뛰어나지만\n" +
            "     이로 인해 우울감이 자주 들기도 합니다.\n" +
            "     사랑을 할 때에는 솔직하게 애정표현을 할 줄 아나\n" +
            "     겁이 많은 성격으로 어려운 상황을 책임지려 하지 않는\n" +
            "     경향도 나타납니다.\n" +
            "\n▶장점\n" +
            "     기억력이 좋다.\n" +
            "     직관적이다.\n" +
            "     여성적이고 신비롭다.\n" +
            "     빈틈이 없다.\n" +
            "     친절하다.\n" +
            "     가정적이다.\n" +
            "     기억력이 뛰어나다.\n" +
            "     남을 도우려 한다.\n" +
            "     배려심이 있다.\n" +
            "     무엇이 필요한지 잘 안다.\n" +
            "\n▶단점\n" +
            "     소유욕이 강하다.\n" +
            "     쉽게 상처 받는다.\n" +
            "     시무룩해한다.\n" +
            "     까다롭다.\n" +
            "     자신을 모욕하면 계속 물고 늘어진다.\n" +
            "     이기적이다.\n" +
            "     겁이 많고 과잉보호 한다.\n" +
            "     과거에 집착한다.\n" +
            "     주관적이고 감정적이다.\n" +
            "     불안정한 자아\n" +
            "\n▶인체\n" +
            "     젖가슴, 위, 간\n" +
            "\n▶직업\n" +
            "     도, 소매업, 부동산, 상담, 숙박업, 요식업, 양육\n" +
            "     영양원예, 가구 인테리어\n";

    String star_5="\n▶사자자리(7월 23일 ~ 8월 22일)\n" +
            "\n▶사람의 이목을 끄는 리더십이 있는\n" +
            "     사자자리는 늘 주인공이 됩니다.\n" +
            "     남에게 조언해 주는 것을 좋아하지만\n" +
            "     자신을 숨기는 것을 못해\n" +
            "     얼굴이 감정표현이 다 드러나\n" +
            "     곤란할 때가 있을 수 있습니다.\n" +
            "\n▶장점\n" +
            "     정직하고 충직하다.\n" +
            "     낭만적이고 밝다.\n" +
            "     왕처럼 당당하다.\n" +
            "     어린아이처럼 천진하다.\n" +
            "     아량이 넓다.\n" +
            "     사교적이고 따뜻하다.\n" +
            "     생기발랄하다.\n" +
            "     다정다감하다.\n" +
            "     책임감이 있다.\n" +
            "     용기 있다.\n" +
            "     관리 능력이 있다.\n" +
            "\n▶단점\n" +
            "     고집이 강하다\n" +
            "     남을 무시한다\n" +
            "     거만하다.\n" +
            "     허영심이 강하다.\n" +
            "     뽐내기를 좋아한다.\n" +
            "     추종자를 원한다.\n" +
            "     자기 만족에 빠진다.\n" +
            "     눈에 띄려고 발버둥친다.\n" +
            "     다른사람을 평가절하한다.\n" +
            "\n▶인체\n" +
            "     등, 척추, 심장\n" +
            "\n▶직업\n" +
            "     연극, 영화, 예술, 모델, 장식, 스포츠, 기획광고, 증권 중개\n";

    String star_6="\n▶처녀자리(8월 23일 ~ 9월 23일)\n" +
            "\n▶총명함과 사람들과 대화를 할 줄 아는 처녀자리는\n" +
            "     꼼꼼하고 정확한 사람으로 완벽주의라고\n" +
            "     오해를 받지만 사실 굉장히 도덕적인 사람입니다\n" +
            "     또한 수줍음을 타는 성격에 상대방을\n" +
            "     답답하게 만들기도 하지만\n" +
            "     특유의 매력을 가지고 있는 사람입니다.\n" +
            "\n▶장점\n" +
            "     젠틀하다.\n" +
            "     다른사람에게 잘 공감한다.\n" +
            "     정리정돈을 잘한다.\n" +
            "     박학다식하다.\n" +
            "     위트있다.\n" +
            "     마음이 따뜻하다.\n" +
            "     근면성실하다.\n" +
            "     헌신적이다.\n" +
            "     현실적이고 겸손하다.\n" +
            "     조직적이다.\n" +
            "     치유능력이 있다.\n" +
            "\n▶단점\n" +
            "     부지런하지 못한 사람을 혐오한다.\n" +
            "     까다롭다.\n" +
            "     독단적이다.\n" +
            "     자주 우울하다.\n" +
            "     신경과민\n" +
            "     감정을 드러내지 않는다.\n" +
            "     비판적이다.\n" +
            "     자부심이 낮고 억압되어 있다.\n" +
            "     건강에 신경쓴다.\n" +
            "\n▶인체\n" +
            "     아랫배, 소장, 비장, 췌장\n" +
            "\n▶직업\n" +
            "     서비스업, 전문기술직, 인쇄, 정밀기계, 의약, 간호\n" +
            "     사무비서직, 평론, 재단, 원예, 교육\n";

    String star_7="\n▶천칭자리(9월 24일 ~ 10월 22일)\n" +
            "\n▶온순한 성격을 가지고 있는 천칭자리는\n" +
            "     사교성이 아주 좋습니다.\n" +
            "     주변에 친구가 많지만 우유부단한 성격 때문에\n" +
            "     곤경에 처하기도 합니다.\n" +
            "     천칭자리는 책을 좋아합니다.\n" +
            "\n▶장점\n" +
            "     협조적이고 합리적이다.\n" +
            "     좋은 동료이다.\n" +
            "     예술적 감각이 뛰어나다.\n" +
            "     세련미가 넘친다.\n" +
            "     사랑스럽고 로맨틱하다.\n" +
            "     센스 있다.\n" +
            "     페어플레이.\n" +
            "     대화가 잘 통한다.\n" +
            "     훌륭한 중재자이다.\n" +
            "     지적이다.\n" +
            "     인기있고 예의바르다.\n" +
            "     다양한 인간관계를 가진다.\n" +
            "     적응력이 좋다.\n" +
            "\n▶단점\n" +
            "     자아도취에 빠진다.\n" +
            "     게으르다.\n" +
            "     우유부단하다.\n" +
            "     권모술수를 부린다.\n" +
            "     거만하고 경솔하다.\n" +
            "     자기방어적이다.\n" +
            "     감정을 억제한다.\n" +
            "\n▶인체\n" +
            "     허리, 골반, 콩팥, 신장, 난소\n" +
            "\n▶직업\n" +
            "     예술, 정치, 외교, 법률, 대리인, 협동사업, 매니저, 브로커\n" +
            "     세일즈\n";

    String star_8="\n▶전갈자리(10월 23일 ~ 11월 22일)\n" +
            "\n▶겉으로는 차분하지만 마음은 뜨거운 전갈자리\n" +
            "     12별자리 성격 중 자존심이 가장 강합니다\n" +
            "     이로 인해 종종 다툼이 있을 수 있지만\n" +
            "     자신이 원하는 것은 열정적으로 체험하고\n" +
            "     느끼는 것을 좋아하는 사람이 많습니다.\n" +
            "\n▶장점\n" +
            "     탐구적인 자세이다.\n" +
            "     초연하고 통찰력있다.\n" +
            "     보호하려는 마음이 있다.\n" +
            "     끈기 있다.\n" +
            "     사람을 끌어당기는 매력이 있다.\n" +
            "     세밀하다.\n" +
            "     감정이 풍부하다.\n" +
            "     신비주의적이고 감각적이다.\n" +
            "     집중력이 강하다.\n" +
            "     남을 인정한다.\n" +
            "     비밀을 좋아한다.\n" +
            "     영적 능력이 있다.\n" +
            "     지도자 자질이 있다.\n" +
            "\n▶단점\n" +
            "     자기 파괴적이다\n" +
            "     무정하다.\n" +
            "     의심과 질투가 많다.\n" +
            "     소유욕이 강하다.\n" +
            "     화를 잘 낸다.\n" +
            "     자주 우울하다.\n" +
            "     평범하지 않은 운명이다.\n" +
            "     권력을 이용한다.\n" +
            "     복잡하다.\n" +
            "     복수심이 강하다.\n" +
            "     순응하지 않는다.\n" +
            "\n▶인체\n" +
            "     생식기, 항문, 배설기관\n" +
            "\n▶직업\n" +
            "     군인, 경찰, 외과의사, 보험, 정신분석, 장의사, 식육점\n" +
            "     정화조 하수구 관계업, 흥신소, 과학연구, 사회자본, 영적지도자\n";

    String star_9="\n▶사수자리(11월 23일 ~ 12월 24일)\n" +
            "\n▶별자리 중 가장 낙천적인 성격을 가지고 있습니다.\n" +
            "     하지만 좋고, 싫음을 분명히 하기 때문에\n" +
            "     솔직한 성격들이 대부분이며\n" +
            "     솔직한 성격 때문에 주변에서 상처를 입기도 합니다.\n" +
            "\n▶장점\n" +
            "     솔직하다.\n" +
            "     남과 터놓고 지낸다.\n" +
            "     낙관적이다.\n" +
            "     사람들의 장점을 잘 본다.\n" +
            "     철학적이고 영적이다.\n" +
            "     운이 좋다.\n" +
            "     박식하다.\n" +
            "     정직하고 공평하다.\n" +
            "     천진난만하다.\n" +
            "     모두에게 자극제가 된다.\n" +
            "     음악과 예술에 조예가 있다.\n" +
            "     감각적이다.\n" +
            "\n▶단점\n" +
            "     따지는 것을 좋아한다.\n" +
            "     참을성이 없다.\n" +
            "     광신도이다.\n" +
            "     도박심리가 있다.\n" +
            "     자신의 재능을 인정하지 않는 사람에게 비판적이다.\n" +
            "     계획을 잘 못 세운다.\n" +
            "     무책임하다.\n" +
            "     실수를 자주한다.\n" +
            "     저돌적이고 거만하다.\n" +
            "     둔감하다.\n" +
            "\n▶인체\n" +
            "     엉덩이, 허벅지, 좌골신경\n" +
            "\n▶직업\n" +
            "     종교, 철학, 강연, 여행, 선전공보업무, 외국관련업, 자유업\n" +
            "     법, 출판\n";

    String star_10="\n▶염소자리(12월 25일 ~ 1월 19일)\n" +
            "\n▶목표지항적인 성격으로 리더 성향을 가지고 있습니다.\n" +
            "     또한 규칙과 질서를 중요시 하여 예의가 바릅니다.\n" +
            "     부지런한 성격이지만 때로는\n" +
            "     융통성이 없다는 말을 듣기도 합니다.\n" +
            "     이러한 성격 때문에 짝사랑을 하는 경우가 종종 있습니다\n" +
            "\n▶장점\n" +
            "     체계화를 잘한다.\n" +
            "     열심히 일한다.\n" +
            "     현실적이다.\n" +
            "     빈틈이 없다.\n" +
            "     두려움이 없다.\n" +
            "     높지만 현실적인 기준을 가지고 있다.\n" +
            "     좋은 충고를 한다.\n" +
            "     전통을 지킨다.\n" +
            "     장수한다.\n" +
            "     권위를 존중한다.\n" +
            "     위기대처 능력이 좋다.\n" +
            "     자부심이 강하다.\n" +
            "     장기적인 안목에서 승리자다.\n" +
            "\n▶단점\n" +
            "     무조건 자기것이 최고라고 여긴다.\n" +
            "     이기적이다.\n" +
            "     남을 혹사 시킨다.\n" +
            "     물질 중시.\n" +
            "     융통성이 없다.\n"+
            "     걱정이 많다.\n" +
            "     매우 비관적이다.\n" +
            "     운명론자이다.\n" +
            "     빈정댄다.\n" +
            "\n▶인체\n" +
            "     무릎, 관절, 피부, 뼈, 손발톱, 담낭\n" +
            "\n▶직업\n" +
            "     공공행정, 조각가, 정치, 경영 관리직, 공예\n";

    String star_11="\n▶물병자리(1월 20일 ~ 2월 18일)\n" +
            "\n▶대부분 독창적인 사람들이 많아 활발한 지적활동을 합니다.\n" +
            "     철학도 중요시 하지만 개인의 성향을\n" +
            "     존중할 줄 아는 사람이지만\n" +
            "     이런 자연스러운 모습 때문에 사람들에게\n" +
            "     비판을 받기도 합니다.\n" +
            "     하지만 혁신적인 아이디어나, 파격행보를\n" +
            "     표현할 줄 아는 사람으로\n" +
            "     늘 미래에서 꿈을 꾸며 살고 있는 미래 지향적인 사람입니다\n" +
            "\n▶장점\n" +
            "     대화가 잘 통한다.\n" +
            "     사려 깊고 배려 깊다.\n" +
            "     협조적이고 이타적이다.\n" +
            "     믿음직해서 타인에게 의지가 된다.\n" +
            "     과학적인 사고를 한다.\n" +
            "     생각과 행동이 자주적이다.\n" +
            "     창의력이 풍부하고 재능이 많다.\n" +
            "     혁신적이고 진보적이다.\n" +
            "     자유를 사랑한다.\n" +
            "     영적 능력이 뛰어나다.\n" +
            "     공동체 의식이 강하다.\n" +
            "     격식을 따지지 않는다.\n" +
            "     비물질주의이고 실험정신이 강하다.\n" +
            "\n▶단점\n" +
            "     좋은 아이디어를 남과 공유하지 않는다\n" +
            "     요령이 없고 무례하다.\n" +
            "     아집이 강하고 심술궃다.\n" +
            "     취향이 별나다.\n" +
            "     외롭다.\n" +
            "     쉽게 마음을 분리시킨다.\n" +
            "     자신감이 없다.\n" +
            "     남의 사생활에 관심을 가진다.\n" +
            "\n▶인체\n" +
            "     발목, 복사뼈, 순환기계통, 부갑상선\n" +
            "\n▶직업\n" +
            "     민간사무, 공공단체업무, 작사, 작곡, 극작가, 공학\n" +
            "     무선통신관련업무, 항공, 비행, 상담\n";

    String star_12="\n▶물고기자리(2월 19일 ~ 3월 20일)\n" +
            "\n▶수줍음이 많지만 예술적인 성향을 가진 물고기자리의\n" +
            "     별자리 성격은 타인을 도울 줄 아는 사람으로\n" +
            "     봉사하기를 좋아하며 상상력이 풍부하기 때문에\n" +
            "     예술인이 되거나 선한 마음으로 성직자의 역할을 하기를 원합니다.\n" +
            "\n▶장점\n" +
            "     사랑이 넘친다.\n" +
            "     배려심이 있다.\n" +
            "     남을 의심하지 않는다.\n" +
            "     호의적이다.\n" +
            "     곤란한 사람을 도우려 한다.\n" +
            "     로맨틱하다.\n" +
            "     헌신적이고 자비롭다.\n" +
            "     타인을 깊이 이해한다.\n" +
            "     감수성이 풍부하다.\n" +
            "     모성애가 강하다.\n" +
            "     영적 능력이 강하다.\n" +
            "     정신력이 강하다.\n" +
            "\n▶단점\n" +
            "     자기 연민에 빠진다.\n" +
            "     현실 도피적이다.\n" +
            "     의존적이다.\n" +
            "     자주 우울하다.\n" +
            "     현실 감각 상실,모든 일을 자기 탓으로 한다.\n" +
            "     자기비하의, 자기희생적이다.\n" +
            "     구원자 콤플렉스이다.\n" +
            "     쉽게 죄의식에 빠진다.\n" +
            "\n▶인체\n" +
            "     발, 체액, 임파선\n" +
            "\n▶직업\n" +
            "     연극, 영화, 예술, 병원, 형무소, 요양원, 박물관, 도서관\n" +
            "     승려, 수도사\n";

    //성
    String first_1="\n시작, 새로운 아이디어, 창조력, 잠재력,활동의 근원, 원시적인 충동들, 약속\n" +
            "어떤 상황이 시작되려 하거나 이미 시작된 초기 단계\n" +
            "1은 근원, 모든 것의 시작과 끝을 나타내는 수\n";

    String first_2="\n협력, 관계, 양극단, 반대되는 힘들의 균형과 조화\n" +
            "이원성, 선택, 결정, 기다리는 기간, 일시적 중지\n" +
            "결정 또는 선택의 시간, 이원성과 연합 사이에서 균형을 찾을 시간";

    String first_3="\n종합, 성장, 창조성, 풍부, 협동, 우정, 예술적 표현\n" +
            "계획 수정, 행동을 취할 준비, 단결과 단체 활동이 강조된다.\n" +
            "진행 중인 계획을 첫 번째나 두 번째 단계에서 수정하라.\n" +
            "목표의 초기 성취\n";

    String first_4="\n기초, 훈련, 일, 질서, 안정성, 견고성, 현실적 성취, 실제적 달성\n" +
            "이전 3의 수준에서 상상하고 계획한 것들이 구체화되기 시작한다.\n" +
            "기초는 안정적이고 건고하다.";

    String first_5="\n새로운 주기, 변화, 전진, 이동, 조정, 미세, 불안정, 도전\n" +
            "다양성, 자유, 용기, 변화가 필요함.\n" +
            "4수준에서 구체화되기 시작한 모든 것에 대한 조절 및 미세 조율\n" +
            "불확실성을 예상하되 그것 역시 지나갈 것임을 알아라.\n";

    String first_6="\n균형, 건강, 변화에 직면해서의 조화\n" +
            "만족, 이완, 소원 성취, 마음의 평정\n" +
            "5수준에서 나타난 도전에 맞서 승리하라. 조화와 균형이 나타난다.\n" +
            "용기를 내라. 생각하는 것보다 목표에 가까이 있다.\n";

    String first_7="\n영성, 지혜, 완전한 질서, 대우주, 종교, 행운, 마법, 다양한 선택\n" +
            "6수준의 세속적인 문제들에 맞서 승리하고\n" +
            "수많은 기회들이 당신에게 열린다.\n";

    String first_8="\n재생, 부활, 재평가, 갈무리, 우선순위 정하기\n" +
            "유지할 것과 버릴 것을 결정하기, 재생과 새로워짐을 생각하라\n";

    String first_9="\n끝맺기, 통합, 이동, 유연성, 성취, 달성\n" +
            "8수준에서 만났던 상황들을 완성하고\n" +
            "그 상황들을 삶 속에 통합한다.\n";

    //성장수
    String grow_1="\n최상의 성장은 자기주장과 개인주의자로\n" +
            "     살아가는 경로를 따라 진행된다.\n";

    String grow_2="\n최상의 성장은 다른 사람과의 관계에 있다.\n";

    String grow_3="\n최상의 성장은 언어력과 창조성을 사용하는데 있다.\n";

    String grow_4="\n최상의 성장은 공포와 안전이라는 주제와 관련된다.\n";

    String grow_5="\n최상의 성장은 자유에 대한 책임에 있다.\n";

    String grow_6="\n최상의 성장은 사랑을 통해 온다.\n";

    String grow_7="\n최상의 성장은 신비주의와 영적인 지식을 통해 온다.\n";

    String grow_8="\n최상의 성장은 돈의 관리와 권력(권위)에 대한 책임을" +
            "통해 온다.\n";

    String grow_9="\n최상의 성장은 자비와 용서를 통해 온다.\n";

    String grow_11="\n최상의 성장은 직관을 가지고\n" +
            "우주원리를 실용적으로 응용해 나가는 것을 통해 온다.\n";

    String grow_22="\n최상의 성장은 직관을 가지고\n" +
            "우주원리를 실용적으로 응용해 나가는 것을 통해 온다.\n";

    String grow_33="\n최상의 성장은 감정에 대해 달통함으로써\n" +
            "자기희생을 하려는 성향을 순교자가 되지 않고서도" +
            "승화하는데서 온다.";


    //혼의수
    String soul_1="\n리더가 되기를 원함, 다른 사람들을 통제하려 하고 명령 복종을 싫어하며 고집불통이다." +
            "의지력과 야망, 독립심, 애정문제는 로맨스가 중요하다.\n" +
            "파트너가 매력적이고, 영리하다." +
            "독립적인 성향을 가지기를 원한다." +
            "때론 매우 차갑고 소원해 보이는데 자기 보호이다.\n" +
            "바보와 일하느니 차라리 혼자 한다.\n" +
            "프로젝트를 생각해 내고 시작하길 원한다.\n";

    String soul_2="\n조화를 갈망 갈등을 견딜 수 없어 리더를 원하지 않는다.\n" +
            "양 측면 바라볼 수 있는 특별한 능력이 있다.\n" +
            "다른 사람을 민감하게 고려 편안하게 만든다.\n" +
            "온정적이고 사랑스러운 영혼이며 애정문제는 최선을 다해 베풀어 주려고 노력하며 가끔 자기 자신을 망각할 정도로 지나치게 베풀어 주기도 한다.\n" +
            "타인으로부터 비난은 심한 상처가 된다.\n" +
            "솔로보다는 결혼, 연애를 통해서 더욱 행복해질 수 있다.\n" +
            "헌신자적 동반자 프로젝트를 위한 것들을 함께 모아가길 원한다.\n";

    String soul_3="\n가슴 안에서는 다른 사람들을 최상의 상태에 다다를 수 있도록 격려하고 웃음을 선사하며 열정을 뿜으면서 타인을 행복하게 하려는 욕망이 꿈틀댄다.\n" +
            "삶 그 자체를 사랑함 애정은 유희적이다\n" +
            "생각의 변화가 잦은데 재미를 추구하는 경향이 있다." +
            "프로젝트에 대해 디자인하고 토론하길 원한다.\n";

    String soul_4="\n계획을 통해 체계적인 방식으로 인생을 살아가고 실용적인 방식으로 일해 나가려는 욕망이 있다.\n" +
            "일의 목표와 점검, 분명한 경계를 정한다.\n" +
            "스스로 통제할 수 있는 상황에 두는 방식이다.\n" +
            "애정문제는 감정적인 접근마저도 매우 실용적인 방식으로 행한다.\n" +
            "프로젝트를 계획하고 실용화하며 관리하길 원한다.\n";

    String soul_5="\n제약에서 벗어나 열정적으로 변화와 여행을 수반하려는 욕망이 있다.\n" +
            "변화무쌍함과 자극을 경험하길 원한다.\n" +
            "애정문제 섹스란 관능, 격력\n" +
            "특별함에 의해 지배, 성적인 자극에 이끌림, 딴따라에 끌림\n" +
            "프로젝트 관련 네트워크를 만들어 판매하길 원한다.\n";

    String soul_6="\n아름다움과 조화와 가정, 이해심과 충성심, 헌신과 애정, 신의의 특징\n" +
            "자신의 가족과 가정을 보호하고 돌보며 사랑하길 원함\n" +
            "애정문제는 매우 이상주의적임.\n" +
            "장미, 촛불, 헤어져도 매달리지 않음.\n";

    String soul_7="\n은둔자, 독신자, 성직자, 수녀, 적막과 고요, 평화\n" +
            "혼자 독서하는 것을 즐긴다\n" +
            "서로 비밀이 잘 유지될 수 있고 독특한 신념 라이프스타일마저도 유지한다.\n" +
            "예민한 영혼의 소유자이다.\n" +
            "대개는 지성이나 고차원적인 인식능력을 발달시키려고 노력함\n" +
            "멀리서도 모든 것을 감지, 프로젝트를 더욱 더 분석하기 원한다.\n";

    String soul_8="\n보스가 되기를 바란다.\n" +
            "복잡한 감정적인 연애보다는 비즈니스에 몰두한다.\n" +
            "가정뿐만 아니라 세상에서도 중요한 사람이 되기를 원함.\n";

    String soul_9="\n연민과 동정심으로 가득한 영혼\n" +
            "가슴 깊은 곳에서는 세상에 대한 사랑과 높은 이상과 힘으로 영향력을 미치며 직관적이며, 자비로운 공감력 높다.\n" +
            "애정문제는 사랑스럽고 이상주의적이며, 소울 메이트를 찾아 나선다.\n" +
            "강렬한 사랑은 끝도 없이, 프로젝트를 끝내고 모든 사람에게 나눠주길 원한다.\n";

    String soul_11="\n극단적으로 예민하기에 신경증이 있거나 정신적으로 문제 있을 수 있다.\n" +
            "감정적 기복 심함, 시대를 뛰어넘는 지혜와 이해력과 예지력을 가졌다.\n" +
            "가슴 속 깊이 모든 관계가 편안해 지길 갈망함, 예감이 발달되어 있다.\n" +
            "고대지식과 영적지혜를 가져오는 임무를 지닌 오래된 영혼이며 동시대인들 보다 더 큰 지혜를 가진 사람이다.\n" +
            "애정문제는 온화하고 달콤하며 상대방을 즐겁게 해주길 원한다.\n" +
            "결코 2인자는 되지 않으려 한다.\n" +
            "어떠한 관계라도 영적인 특성을 불러오는데 다른 세상에 대해 알고 있기 때문이다.\n" +
            "프로젝트를 개선하기를 원한다.\n";

    String soul_22="\n인류의 이익과 지속적으로 존재할 수 있는 것을 현실화해 나가길 갈망한다.\n" +
            "큰 규모의 개혁 리더십을 통해 정신적으로 설득해 나갈 수 있는 능력의 소유자 미래학자들이다.\n" +
            "지구의 삶에 더욱 실제적인 물질적 토대가 안정될 수 있도록 구축해 나가게 된다.\n" +
            "신중하기 때문에 실용적이며, 명확한 목표를 지니고 삶이 안정되어 있는 파트너를 선호한다.\n" +
            "같은 꿈을 공유할 연인 원한다.\n" +
            "영원히 지속될 만한 기념비적인 프로젝트를 만들길 원한다.\n";

    String soul_33="\n도움을 필요로 하는 모든 이들에게 무조건적인 사랑을 베풀기를 갈망한다.\n" +
            "기쁨과 사랑이 넘치며, 보호와 관심, 도움이 필요한 사람들을 어루만져줌.\n" +
            "사랑의 진동을 가장 최상의 수준인 우주 삼라만상에 대한 자비심으로 끌어올린다.\n" +
            "프로젝트를 죽을 때까지 사랑하고 모든 사람들에게 가르치길 원한다.\n";


    //성격수
    String cha_1="\n지배적이고 힘차 보이는,  창조적인, 확신과 자기신회가 있어 보이는,  용기 있는,  집단에 종속되지 않는,  " +
            "세련되고 전문적인 이미지를 투사하는,  디자이너의 의상을 입지만 자신의 패션 스타일을 고집하는,  " +
            "밝고 때론 대담한 무늬의 의상을 입는 경향이 있는,  지나치게 완벽주의 옷차림,  몸에 꼭 맞는 옷 즐겨 입음.\n";

    String cha_2="\n내성적이면서 부끄러움이 많은,  신중하게 한 발짝 물러나 지켜보는,  깨끗한, 깔끔해 보이는,  " +
            "협동적이고 타인을 기쁘게 하기 위해 노력하는,  조용하고 평화로우며 외교적인,  겸손한,  " +
            "예술적으로 보이는,  지나치게 꼼꼼해 보이는,  이성에겐 좋은 동반자로 생각되는,  매력적인,  주목을 받으면 당황하는,  " +
            "까다로워 보일 수 있는,  타인의 관심을 피할 수 있는 무난한 스타일을 선호하는,  경청하는,  논쟁과 갈등을 피하는,  " +
            "보호 받기를 원하는 것처럼 보이는,  지나치게 몰개성적으로 보임,  부드럽게 흘러내리는 장신구,  독특한 색상의 의상착용.\n";

    String cha_3="\n재미있어 보이는,  사람을 끌어당기는 매력의 소유자,  친근하고 활기찬, 파티에 목숨 건,  수다쟁이,  즐겁고 매력 넘치는,  외향적이고 사교적인,  " +
            "때론 지나치게 각광을 받으려고 하는,  매력적인 외모,  긍정적인 관점,  매순간마다 열광하는,  재치있는 언어능력,  훌륭한 유머감각,  " +
            "색상과 스타일 모두 뛰어난 의상선택,  지나치게 과장해 말하거나 많은 말을 하는 경향,  질투심을 잘 통제해야 함.\n";

    String cha_4="간편한 활동복 차림을 좋아하는,  착실하고 한결같으며,  정직한 시민처럼 보이는,  원칙을 강조하는,  " +
            "결과가 부정적이더라도 지름길로 가지 않는 실용적이면서 경제적이고 오래 입을 수 있는 의상을 선택하는,  태도와 유행에 있어서 보수적인,  " +
            "검소하고 소박한,  근면하고 일벌레인,  믿을 수 있고 진실하며 책임감 있는,  부끄러움이 많고 내성적인,  시시해 보이는 일들을 즐기는 것이 어렵다는 것을 아는 지루한 사람으로 인식, 완고함과 엄격함.\n";

    String cha_5="\n성적으로 매력적인,  활력 넘치고 재치있는,  변화와 다양성을 선호하는,  선택의 자유가 선호순위 1위인,  최신유행에 맞춰 감각 있게 옷을 입는,  " +
            "밝고 반짝이는 색상의 옷을 입는,  사교적이며 원기 왕성한,  사람들을 끌어당기는 매력의 소유자,  어려보이는, 완전히 그 순간을 살아가는,  " +
            "관능적이며 오감만족을 즐기는,  이동하는 것을 좋아하는,  유능한 네트워크의 달인으로 대화를 즐기는,  진취적인 사고를 지닌,  오늘을 살아가는 사람,  여행 만병통치약(책임회피로 보임)\n";

    String cha_6="\n친절한 파티 주최자들,  완벽주의자와 이상주의자,  방어적이면서 신뢰할만한,  자신의 책임이 아닌 것도 해주려고 하는,  다른 사람들을 위한 상담과 조언,  " +
            "가정적인 예술적 재능과 사물을 아름답게 꾸미기 좋아하는,  뛰어난 색채감,  멋지고 편안한 느낌의 의상을 선호하는,  칭찬받으려는 욕구,  타고난 선생님,  " +
            "동정심있고 사람들에게 확신을 고무시키는,  외모에 무관심하거나 집안 정리 안 될 수도 있음.\n";

    String cha_7="\n신비와 비밀의 분위기를 즐기는,  생각에 몰두하는 것처럼 보이는,  인지력과 관찰력 있는,  지적인,  엄숙하면서도 내성적인,  냉담한,  " +
            "한정된 취향의 옷만 입는,  옷매무새가 있고 단정한,  오래된 것을 좋아하는,  통찰력이 있고 내면을 향하는,  독특하고 때론 기괴한 취향의,  " +
            "처음에는 다가가기가 어려운,  신비주의와 철학적인,  만약 다가가 애기한다면 매우 좋은 대화상대인,  훌륭한 스타일이 중요한,  매우 개인적인,  다른 사람들이 부정적 회의적 냉소적으로 봄.\n";

    String cha_8="\n성공적으로 보이는 의상,  유창하고 권력이 있어 보이는, 야망의,  힘을 발산하는,  실제 삶보다 더 위대해 보이는,  권위,  고급 의상과 악세사리를 한,  " +
            "통제하려고 하는,  비즈니스 마인드,  조직화된,  비전을 지닌,  자신의 권한을 위임하는 법을 아는,  확신 있고 경쟁적이며 공격적인,  지적인,  원숙한,  전통적인,  차갑고 형식적이며,  재치없고 권위주의적인 사람으로 보임.\n";

    String cha_9="\n관대하면서 가끔씩은 지나친 호의인,  참을성 많고 자비심 있는, 철학적인,  따뜻하고 친절하며 잘 보살펴주는,  이상주의적이고 로맨틱한,  정서적이고 직관적인,  " +
            "행운있는, 잘 설레는,  성취하는,  빠른 결정을 못 내리는,  상처 받기 쉬운,  형이상학적이고 거리가 있는 듯한,  세상에 대해 매우 박식한,  " +
            "사람들을 물질적인 성취결과 판단하지 않는, 인정있는,  다른 사람들에게 매우 사랑받고 존경받는,  극적인 연출력을 돋보이게 하는 깜짝 놀랄만한 의상을 입는,  " +
            "불의에 대해서는 가차 없는,  언제나 동안으로 보이는,  다른 사람들의 문제 관여함으로서 자신의 감정은 억압된 심한 정신적 불균형 초래,  검정색 좋아함,  밝은 색을 입어라.\n";

    String cha_11="\n비전을 보는,  영감있는,  천재적인,  다른 사람보다 더욱 영적으로 보이는,  독창적이고 예술적이며 독특한 옷을 입는,  개인주의적인,  인생의 풍미가 느껴지는,  " +
            "창조적이며,  혁신적인,  긴장하는,  자신의 현실을 창조하는,  세부사항까지 잘 다루는 능력,  초감각을 가진,  직관,  싸이킥 텔레파시 능력이 있는,  지나치게 의존하는 사람으로 보임,  긴장하고 우울하고 예민한 모습으로 보임.\n";

    String cha_22="\n경쟁에서 후광을 얻은,  수퍼우먼이나 수퍼맨으로서 강한 인상을 주는, 목적의식이 강한,  결정력있는,  견고하고 안정된,  실용적이며,  창조적인,  " +
            "물질적인 성공을 가져오는,  상식적으로 문제에 접근하는,  문제 해결사,  건설자,  마치 세상을 통제하는 듯이 보이는,  달인의,  효율적이고,  외교적으로 보이는,  맞춤의 보수적인 스타일의 의상을 입는,  정직한, 생산적인,  " +
            "심각한,  책임감있는,  계획하고 리스트를 작성하며,  목표를 설정하고 점검하기를 좋아하는,  일중독,  삶을 여유롭게 즐기는 모습 보여주기를.\n";

    //운명수
    String des_1="\n자아를 개발해 리더가 되는 것\n" +
            "인생목적은 용기이다.\n" +
            "새롭게 시작하며, 독창적이며 혁신적으로 임무를 완수해 나가는 것이다.\n" +
            "자기 정체성을 확립하고 의지력을 돈독히 하는 것과 확실한 의사결정력을 필요로 한다.\n" +
            "홀로서기, 스스로 생각하기, 자신의 특성을 완전히 이해하는 것이다.\n" +
            "새로운 생각과 대상, 독특한 행동방식들을 통해 펼쳐질 것이다.\n" +
            "확신 결여, 지체하는 버릇, 먼저 리더로서 역량을 키워라.\n";

    String des_2="\n현생의 사업은 조화를 창조하는 일\n" +
            "인생 목적은 균형을 이루고 협동하며 인내하는 조직의 일원이 되는 것이다.\n" +
            "대인관계 기술을 개발하는 것이 필요. 우유부단, 평화 중재자.\n";

    String des_3="\n사명은 사람들에게 활력을 주고 영감을 고무하는 일\n" +
            "목적은 ‘즐거움은 전파력을 갖는다는 것’ 이다.\n" +
            "기회는 타고난 재능인 언어를 통해 자신의 감정을 표현해 나가는 것을 배우고 경쾌함과 재치를 지니는 것을 통해 펼쳐진다.\n" +
            "기분파, 비판적, 표현하고 적극적이며 용기있게 임하라.\n";

    String des_4="\n사명은 지속적인 가치를 지닌 것을 건설하는 일\n" +
            "실용적인 삶의 방식을 취하고 열심히 일하는 것이다.\n" +
            "안전을 위해 질서와 관습 이용\n" +
            "목표를 위한 기회의 장은 전통적인 가치를 표현하는 것을 배우고 느려도 꾸준하고 안정감 있게 생활해 나가는 것을 통해 펼쳐질 것이다.\n" +
            "완고하고 의심이 많음, 관리와 조직화를 위해 살도록 예정된다.\n" +
            "모든 일에 초석을 세우고 그것을 기반으로 건설해 나가라.\n";

    String des_5="\n사명은 적응, 변화, 진보이다.\n" +
            "목적은 자유를 추구하고 자신을 이끌 수 있는 것이면 무엇이든지 자신의 호기심을 따라가는 것이다.\n" +
            "자신의 타고난 재능이나 사람들을 끌어들이는 자석같은 매력을 사용한다.\n" +
            "자유로운 영혼이 되는 법을 배우는 것, 들떠있거나 불만족이 가득하다.\n" +
            "자유와 해방을 위해 전진해 나가라.\n";

    String des_6="\n사명은 봉사, 목적은 가족을 돌보고 사람들을 사랑하는 것\n" +
            "자신을 둘러싼 세상과 조화를 창조하기 위해 미(美)나 공동체에 대한 사랑 드러내기.\n" +
            "관대한 표현과 다른 사람들에게 안락함을 주는 것을 배우는 것을 통해 펼쳐질 것이다.\n" +
            "상호의존적이고 자학하는 경향이 있다.\n" +
            "양육과 아름답게 가꾸는 것을 위해 조화롭게 사랑하라.\n";

    String des_7="\n사명은 분석과 탐구\n" +
            "목표는 깊게 연구해 자신이 맞닥뜨린 것에 대해 완성해 나가는 것이다.\n" +
            "내면이 지혜를 알기 위해 타고난 연구능력과 완벽주의적인 방식 사용한다.\n" +
            "예리한 관찰력과 사고력과 분별력을 배우는 것을 통해 펼쳐질 것이다.\n" +
            "냉소적, 회의적, 전문가가 되어 지혜를 가르쳐라.\n";

    String des_8="\n사명은 자신에 대한 완전한 통제, 목적은 성취와 성공\n" +
            "경영에 대한 기술을 사용, 권위를 표현하고 자신의 저력을 발견하며 비전을 내다보는 법을 배우는 것을 통해 펼쳐질 것이다.\n" +
            "무자비하고 거만하다.\n" +
            "성공을 위해 살도록 자신을 통제하고 능수능란한 리더십을 발휘하라.\n";

    String des_9="\n사명은 무조건적으로 온전히 사랑하는 것\n" +
            "목적은 보편적인 형제애를 갈망, 이타심과 민감성이다.\n" +
            "치유 기술을 사용, 자기변혁과 치유\n" +
            "관용과 용서를 배우는 것을 통해 펼쳐질 것이다.\n" +
            "쉽게 속는 호인(허당)이다.\n" +
            "편협한 사람, 지평을 넓히기 위한 삶을 위해 다른 사람에게 다가가서 도와줘라.\n";

    String des_11="\n사람들의 영감을 고무시키고 의식을 상승하는 일\n" +
            "자신의 직관력이 인류 대의를 위해 사용되어야 하는 것을 인식하고 다른 사람들의 삶을 개혁하고 상승시키며, 변형해 주는 일을 하게 된다.\n" +
            "시련이 와도가르치는 능력을 개발하고 시련을 극복하는 것을 배우는 것으로부터 펼쳐질 것이다.\n" +
            "참을성 없고 비판적이며, 예민함, 영감에 찬 리더이다.\n";

    String des_22="\n사명은 꿈을 실현하고 인류를 위한 계획과 프로젝트를 실행하는 일\n" +
            "목적은 영적인 원리가 작동하는 물질세계 안에서\n" +
            "실용적인 방식을 통해 계획을 실현해 나가는 것이다.\n" +
            "자신의 효율성과 경쟁력을 재고 자신의 천성에 기초하면서 진실해 지는 과정을 통해 결코 포기하지 않는 법을 배우는 것에서 펼쳐질 것이다.\n" +
            "완고하고, 다른 사람들의 결점을 쉽게 받아들일 수 없다.\n" +
            "건설의 달인으로 물질세계에 영적인 법칙을 가져오는 사람이다.\n";

    String des_33="\n사명은 인류의 진일보를 위해 더 높은 차원의 사랑을 기쁘게 베풀어주는 것\n" +
            "목적은 사랑하는 마음으로 타인을 위해 봉사하는 것이다.\n" +
            "삶이란 재미와 사랑으로 가득하다는 것을 사람들에게 가르쳐주는 일이다.\n" +
            "기쁨과 빛, 사랑과 봉사를 펼칠 수 있는 곳의 리더가 되는 것을 통해 펼쳐질 것이다.\n" +
            "지나치게 감정적이며, 자신이 직면하는 가난과 결핍에 의해 사기가 저하된다.\n" +
            "치유의 달인으로 사랑이야말로 진정한 치유사임을 모두에게 가르쳐라.\n";

    //인생 여정수
    String life_1="\n독립의 길, 자수성가, 리더십, 개척자.\n" +
            "자신의 독특한 발상을 활용할 수 있는 환경과 개척자 정신이 직업\n" +
            "성공, 비즈니스, 건강과 엔터테인먼트 산업,\n" +
            "정부기관, 서점 관련일 10/1 완성,재탄생 .완전한 익힘\n" +
            "19/1 우주적 지혜를 신성하게 사용하는 법 배워서 힘의 남용 개정\n";

    String life_2="\n균형과조화의 길, 협동과 타협이 가져다주는, 장점을 배우게 됨\n" +
            "화합(타고난 사교가), 명상가, 평화중재자, 섬세함을 요하는 일\n" +
            "보좌하는 역할, 자료수집 민감성 활용하는 일.\n";

    String life_3="\n창조와 자발성의 길, 낙관성과 열정, 타인의 영감을 고무, 언변가\n" +
            "재치, 밝은 에너지, 마치 생생한 그림을 보듯이 명료하게 전달하는 언어력\n" +
            "예술성과 관련된 일, 작가, 디자이너, 일러스트레이터, 무용가, 배우.\n";

    String life_4="\n근면하고 체계적으로 일하는 길\n" +
            "충성심과 규칙준수 신뢰를 배우는 게임\n" +
            "구조물을 건설, 타고난 건설가, 안전, 느리지만 꾸준하게\n" +
            "시스템이나 건설 매니저, 경리나 회계사, 행정, 교육, 비즈니스\n" +
            "문서나 생산물의 관리, 조심스럽게 관리\n" +
            "체계화될 필요와 지속적인 가치를 지닌 일\n";

    String life_5="\n인생이란 변화의 게임, 자유의 투사, 타고난 혁신가\n" +
            "자유무역수완, 세일즈와 마케팅, 다양한 종류의 판촉활동에 능숙\n" +
            "대중 상대하는 일, 신생업종, 의사소통, 광고\n" +
            "명성을 얻거나 세일즈와 관련되는 일\n" +
            "일상적인 일보다는 활력적인 일, 탐정, 미스테리물의 작가\n" +
            "여행 관련 작업 14/5 질서와 안정성을 통해 자유의 남용 개정\n";

    String life_6="\n다른 사람을 도와주려는 마음, 자리이타(自利利他)\n" +
            "타고난 상담가(공감하고 돌보려는 마음), 상담사, 고문, 선생님, 치유사\n" +
            "가정과 일 사이에 균형을 이루는 법을 배우게 될 것\n" +
            "자신을 둘러싼 세상을 아름답게 만들기 위해 노력, 서비스업\n" +
            "다른 사람들을 위해 보다 안락하고 편안하며\n" +
            "우아한 삶을 만들어가기 위해 노력\n" +
            "의료업, 가구상, 리모델링, 장식, 미용업, 가족경영이나 가내공업, 동물조련\n" +
            "교육업, 정원 가꾸기 양육과 가정의 수인\n";

    String life_7="\n분석하는 삶, 미스테리와 설명할 수 없는 대상을 탐구\n" +
            "영적 지혜를 타인과 공유, 탐구자, 컴퓨터 프로그래머, 첨단기술전문가\n" +
            "분석과 연역적 추론, 경리나 회계사, 법률관련 계열, 교육업, 종교지도자\n" +
            "16/7 영적 재탄생을 통해 책임감과 사랑의 남용을 개정\n";

    String life_8="\n돈(물질)과 진정한 가치(비물질적인)간에 차이를 분별해 나가는 삶\n" +
            "장인의 길, 자신의 타고난 힘과 권위를 가지고 일하는 법 배워야함.\n" +
            "책임자의 지위, 보스, 큰 조직, CEO, CFO,임원, 파이낸셜 상담, 부동산 중개인\n" +
            "스포츠 감독, 재판과, 병원장, 은행장\n";

    String life_9="\n우주 삼라만상이 상호 연결되어 있다는 것 이해하는 삶\n" +
            "자비와 관용을 배우는 우주적 사랑의 길, 관용, 타고난 치유사, 글, 작곡\n" +
            "회화나 조각, 국제 무역, 예술, 교육, 건강\n" +
            "구호나 치유 사업을 기획하거나 인도주의 단체에 참가\n";

    String life_11="\n인류에게 영성과 영감을 고취시키게 될 것\n" +
            "사람들이 쉽게 다가올 수 있도록 하기 위해서 영감에 찬 리더,\n" +
            "카리스마적인 리더이자, 자석처럼 끌어당기는 매력의 소유자\n" +
            "사람들에게 강한 감동과 전율 느끼게 만듦\n";

    String life_22="\n꿈을 실현하는 여정, 영감을 드러내는 사람들 건설의 달인\n" +
            "인류공영에 적극적인 창조자, 기획자, 조직가, 배우, 외교관, 대사, 대통령\n" +
            "큰 규모 사업체의 고위임원, 자신의 분야에서 전문가로서 인정받게 됨.\n" +
            "성공이란 조화와 협동뿐 아니라 인류공헌이라는 이상을 실현하는 것을 배움\n";

    //완성수▶
    String comp_1="\n인생초반에 리더쉽에 대해 배움. 강력한 소신과 야망을 통해 권위 있는 삶 영위. 적극적 삶, 건강 회복 빠름, 큰 비전과 대규모 방식으로 일하기 좋아함. 진정한 독립과 자기 확신을 통해 자신의 비즈니스 구축.\n";

    String comp_2="\n평화를 위한 중재자, 예술적인 재능이 뛰어남. 자신의 주변의 조화를 통해 행복을 느끼며 중년 이후 사람들과의 관계를 맺으면서 진정한 내면의 평화를 얻음. 자신의 직관의 순수성을 잃지 말아야 함.\n";

    String comp_3="\n타고난 열정과 열광하는 특성, 우정의 기쁨과 창조적인 추구를 위한 시간을 가짐. 세상과 조화로울 때 재정적으로 안정됨.\n";

    String comp_4="\n꿈을 현실화 하려는 욕망이 있음. 조직화 하는 재능. 다음세대에도 볼 수 있는 영구적인 가치를 지닌 것을 건설하고 싶어함. 건강에도 관심 많음.\n";

    String comp_5="\n흥분과 변화로 가득 참. 세계도처를 여행하며 새로운 것을 탐험해 나감. 영원한 젊음의 수. 다방면에 관심을 가지고 모든 것에 호기심을 느끼기에 삶의 방향성은 때로는 혼란. 자유\n";

    String comp_6="\n복지와 형평성과 미덕, 가족의 가치를 중히 여김. 활동의 중심 무대는 부엌. 결혼이나 유산상속을 통해 부유해 짐. 상담사나 선생님, 공동체를 위한 활동.\n";

    String comp_7="\n은둔자적이고 분석적인 자신만의 독특한 방식을 살아감, 구루가 되어가는, 명상과 글쓰기, 독서에 시간 할애. 영적이고 철학적인 것에 관심을 가짐.\n";

    String comp_8="\n성취를 통한 보상. 물질세계와 정신세계의 균형을 통해 성취. 죽기직전까지 조직을 만들고 비즈니스적 문제에 참여.\n";

    String comp_9="\n완벽한, 자비심, 진정한 우주적 사랑 발견이 큰 즐거움이 됨, 자신을 내려놓는 법을 배움. 인류를 위한 치유활동에 참여.\n";

    String comp_11="\n영적인 관심, 정화를 위한 건강과 영양에 관심. 예민하고 긴장하기 때문에 식이요법 필요, 명상가, 협상가 중재자. 인류의 영감을 고무시키고 국내나 해외에 대중서비스를 위해 일함.\n";

    String comp_22="\n내면의 안정과 힘, 도전에 강함, 영적인 신념을 현실적인 목표와 결합하는 새로운 과정을 마스터하기. 인류의 이익을 위해 공헌.\n";

    String comp_33="\n애정과 기쁨, 사랑 문제 해결 능력으로 인류에 공헌, 인류를 돌보는 일, 상호 의존성과 결혼 실패 등은 시련\n";

    //1년수
    String year_1="\n프로젝트를 시작하는 해, 독립과 용기, 책임과 응용의 시간이다. 새로운 자기 자신을 만들기 위한 시가이며, 9년 주기를 위해 씨를 뿌려야 한다. 자기 자신의 욕구와 친해지는 시간이다.\n";

    String year_2="\n후원하고 재조직화 하는 해, 기다림과 지연의 시기이다. 행동보다는 타인의 욕구에 민감해지는 시간이다. 천천히 진행하며 타인의 말에 귀 기울이고 자신의 판단을 위임하기도 한다. 타협과 조화의 시간이다.\n";

    String year_3="\n감정적인 고통을 느끼게 되는 해, 자신의 가슴속에 있는 것들을 외부세계에 진실하게 말하기를 배우는 시간이다. 자기표현의 해로 글을 쓰고, 예술적 재능이나 영감, 대중연설과 관련된 프로젝트를 위한 시간이다. 즐거움과 재미, 타인과 즐기는 시간이기도 하다.\n";

    String year_4="\n어떤 것을 관리(건강)하는 해, 질서를 갖추고 체계를 정비하고 미래를 위한 토대를 마련하는 시간이다. 원가족 작업을 통해 문제의 근본으로 돌아가 자신의 어린시기와 성인기의 조각을 맞추는 재조립시기이다. 장기적인 결정을 하고 안정성과 신뢰의 시간으로 열심히 일하는 해이다.\n";

    String year_5="\n개인적 변화의 해, 태도나 일, 삶의 방향성에서의 변화이다. 형이상학 수업, 새로운 주제 탐구에 몰입하는 시간이다. 이동, 직업, 진로 변경의 해이며, 위험과 비일상적인 일을 감행하며 여행이 도움이 되는 해이다.\n";

    String year_6="\n가족들에게 시간을 내어주어야 하는 해, 자신의 일과 가정간의 균형을 요구하는 시기이다. 자신이 돌봐야 하는 사람들을 양육하고 그들을 위해 봉사하는 해이다. 인간관계나 결혼생활 유지에 대해 생각하는 시간이 되기도 한다.\n";

    String year_7="\n자신의 내면으로 이동하는 해, 안식년(휴식)이나 조용히 비전이나 인간관계, 인생의 방향등을 재평가 하기에 좋은 시간이다. 영성과 신비주의 형이상학적 주제에 대해 끌리게 된다. 고독을 추구한다. 신체를 정화하는 시기이기도 하며, 법률문제를 관할한다.\n";

    String year_8="\n자신의 힘에 대해 배우고 리더나 권위자로서의 역할에 매진하는 해, 비즈니스를 시작하기도 한다. 돈과 성공의 에너지를 다루어야 하는 시간이며 어떤 일을 관리하는 해이다.\n";

    String year_9="\n추수가 진행되는 해, 8년 동안의 노력의 보상이 주어지는 시기이다. 인생에 대한 큰 그림을 그리고 치유하고 꿈꾸는 시기이며, 구체화 하는 시간이다. 용서와 망각의 시간이다. 어떤 일을 완성하거나 마무리하는 시간이다. \n";

    //1달수

    String month_1="\n씨뿌리고 시작하기\n";

    String month_2="\n협동하고 인내하기\n";

    String month_3="\n유쾌하고 친구들과 함께하기\n";

    String month_4="\n열심히 일하고 건강관리하기\n";

    String month_5="\n변화를 만들기\n";

    String month_6="\n양육하고 가정을 꾸미기\n";

    String month_7="\n탐색하고 연구하기\n";

    String month_8="\n책임을 지고 돈을 다루기\n";

    String month_9="\n종결하고 보상받기\n";




    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);
        name=(EditText)findViewById(R.id.start_name);
        birthyear=(EditText)findViewById(R.id.birth_year);
        birthmonth=(EditText)findViewById(R.id.birth_month);
        birthday=(EditText)findViewById(R.id.birth_day);
        calendar_year=(EditText)findViewById(R.id.calendar_year);
        findViewById(R.id.button01).setOnClickListener(mybutton);
    }

    Button.OnClickListener mybutton=new Button.OnClickListener(){
        public void onClick(View v){
            String subi="";
            String getName =name.getText().toString();
            final String getYear =birthyear.getText().toString();
            final String getMonth =birthmonth.getText().toString();
            final String getDay =birthday.getText().toString();
            final String getCalendar=calendar_year.getText().toString();

            TextView subi_print = (TextView)findViewById(R.id.subi_print);
            TextView tanseng_print = (TextView)findViewById(R.id.tanseng_print);
            TextView soul_print = (TextView)findViewById(R.id.soul_print);
            TextView star_print = (TextView)findViewById(R.id.star_print);
            TextView cha_print = (TextView)findViewById(R.id.cha_print);
            TextView soul2_print = (TextView)findViewById(R.id.soul2_print);
            TextView des_print = (TextView)findViewById(R.id.des_print);
            TextView life_print = (TextView)findViewById(R.id.life_print);
            TextView comp_print = (TextView)findViewById(R.id.comp_print);
            TextView grow_print = (TextView)findViewById(R.id.grow_print);
            TextView sex_print = (TextView)findViewById(R.id.sex_print);
            TextView age_print = (TextView)findViewById(R.id.age);
            TextView calendar_print = (TextView)findViewById(R.id.calendar);
            final ImageView calendar_image = (ImageView)findViewById(R.id.calendar_image);
            TextView year_print=(TextView)findViewById(R.id.year_numberz);
            TextView year_number_print=(TextView)findViewById(R.id.year_number_print);
            final TextView month_print=(TextView)findViewById(R.id.month_number);
            final TextView month_number_print=(TextView)findViewById(R.id.month_number_print);
            final TextView calendar_print_123=(TextView)findViewById(R.id.calendar_print);

            calendar_print_123.setText("< 달력 >");
            calendar_print_123.setPaintFlags(calendar_print_123.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

            month_print.setText("<  1월수  >");
            month_print.setPaintFlags(month_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

            if (getName.equals("")) {
                Toast toast = Toast.makeText(getApplicationContext(), "이름을 입력하세요",Toast.LENGTH_SHORT);
                toast.show();
            }else if (getYear.equals("")) {
                Toast toast = Toast.makeText(getApplicationContext(), "년도를 입력하세요",Toast.LENGTH_SHORT);
                toast.show();
            }else if (getMonth.equals("")) {
                Toast toast = Toast.makeText(getApplicationContext(), "월을 입력하세요",Toast.LENGTH_SHORT);
                toast.show();
            }else if (getDay.equals("")) {
                Toast toast = Toast.makeText(getApplicationContext(), "일을 입력하세요",Toast.LENGTH_SHORT);
                toast.show();
            }
            else if (getCalendar.equals("")) {
                Toast toast = Toast.makeText(getApplicationContext(), "달력년도를 입력하세요",Toast.LENGTH_SHORT);
                toast.show();
            }

            else {
                int year_month_day = Integer.parseInt(getYear) + Integer.parseInt(getMonth) + Integer.parseInt(getDay);
                final int[] list=new int[80];
                for(int i=0;i<80;i++){
                    String b=Integer.toString(year_month_day+i);
                    String[] b_split=b.split("");
                    int sum=Integer.parseInt(b_split[1])+Integer.parseInt(b_split[2])+Integer.parseInt(b_split[3])+Integer.parseInt(b_split[4]);
                    if (sum>22) {
                        String str_sum = Integer.toString(sum);
                        String[] sum_split = str_sum.split("");
                        int total_sum = Integer.parseInt(sum_split[1]) +
                                Integer.parseInt(sum_split[2]);
                        sum = total_sum;
                    }
                    list[i]=sum;
                }

                int tanseng=list[0];
                subi+="\n▶탄생수("+Integer.toString(tanseng)+")  ";
                int soul=tanseng;
                if(soul>10){
                    String str_soul=Integer.toString(soul);
                    String[] soul_split = str_soul.split("");
                    soul=Integer.parseInt(soul_split[1])+Integer.parseInt(soul_split[2]);
                }
                if(soul ==10){
                    soul=1;
                }

                subi+="영혼수("+Integer.toString(soul)+")  ";

                ImageView image1=(ImageView)findViewById(R.id.imageview1);

                ImageView image5=(ImageView)findViewById(R.id.imageview5);

                TextView textview1 = (TextView)findViewById(R.id.textview1);

                TextView textview2 = (TextView)findViewById(R.id.textview2);

                tanseng_print.setText("<  탄생수 ("+Integer.toString(tanseng)+")  >");
                tanseng_print.setPaintFlags(tanseng_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

                switch(tanseng){
                    case 1:
                        image1.setImageResource(R.drawable.t1);
                        textview1.setText(taro_1);break;
                    case 2:
                        image1.setImageResource(R.drawable.t2);
                        textview1.setText(taro_2);break;
                    case 3:
                        image1.setImageResource(R.drawable.t3);
                        textview1.setText(taro_3);break;
                    case 4:
                        image1.setImageResource(R.drawable.t4);
                        textview1.setText(taro_4);break;
                    case 5:
                        image1.setImageResource(R.drawable.t5);
                        textview1.setText(taro_5);break;
                    case 6:
                        image1.setImageResource(R.drawable.t6);
                        textview1.setText(taro_6);break;
                    case 7:
                        image1.setImageResource(R.drawable.t7);
                        textview1.setText(taro_7);break;
                    case 8:
                        image1.setImageResource(R.drawable.t8);
                        textview1.setText(taro_8);break;
                    case 9:
                        image1.setImageResource(R.drawable.t9);
                        textview1.setText(taro_9);break;
                    case 10:
                        image1.setImageResource(R.drawable.t10);
                        textview1.setText(taro_10);break;
                    case 11:
                        image1.setImageResource(R.drawable.t11);
                        textview1.setText(taro_11);break;
                    case 12:
                        image1.setImageResource(R.drawable.t12);
                        textview1.setText(taro_12);break;
                    case 13:
                        image1.setImageResource(R.drawable.t13);
                        textview1.setText(taro_13);break;
                    case 14:
                        image1.setImageResource(R.drawable.t14);
                        textview1.setText(taro_14);break;
                    case 15:
                        image1.setImageResource(R.drawable.t15);
                        textview1.setText(taro_15);break;
                    case 16:
                        image1.setImageResource(R.drawable.t16);
                        textview1.setText(taro_16);break;
                    case 17:
                        image1.setImageResource(R.drawable.t17);
                        textview1.setText(taro_17);break;
                    case 18:
                        image1.setImageResource(R.drawable.t18);
                        textview1.setText(taro_18);break;
                    case 19:
                        image1.setImageResource(R.drawable.t19);
                        textview1.setText(taro_19);break;
                    case 20:
                        image1.setImageResource(R.drawable.t20);
                        textview1.setText(taro_20);break;
                    case 21:
                        image1.setImageResource(R.drawable.t21);
                        textview1.setText(taro_21);break;
                    case 22:
                        image1.setImageResource(R.drawable.t22);
                        textview1.setText(taro_22);break;
                }
                soul_print.setText("<  영혼수 ("+Integer.toString(soul)+")  >");
                soul_print.setPaintFlags(soul_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

                switch(soul){
                    case 1:
                        textview2.setText(what_1);break;
                    case 2:
                        textview2.setText(what_2);break;
                    case 3:
                        textview2.setText(what_3);break;
                    case 4:
                        textview2.setText(what_4);break;
                    case 5:
                        textview2.setText(what_5);break;
                    case 6:
                        textview2.setText(what_6);break;
                    case 7:
                        textview2.setText(what_7);break;
                    case 8:
                        textview2.setText(what_8);break;
                    case 9:
                        textview2.setText(what_9);break;
                }
                TextView starview = (TextView)findViewById(R.id.starview);

                switch(Integer.parseInt(getMonth)){
                    case 3:
                        if (Integer.parseInt(getDay)>=21) {
                            starview.setText(star_1);
                            image5.setImageResource(R.drawable.aries);
                            subi+="별자리(양)\n\n";
                            star_print.setText("<  별자리 (양)  >");
                            star_print.setPaintFlags(star_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                            break;
                        }
                        else{
                            image5.setImageResource(R.drawable.pisces);
                            subi+="별자리(물고기)\n\n";
                            star_print.setText("<  별자리 (물고기)  >");
                            star_print.setPaintFlags(star_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                            starview.setText(star_12);break;
                        }
                    case 4:
                        if (Integer.parseInt(getDay)>=20) {
                            starview.setText(star_2);
                            image5.setImageResource(R.drawable.taurus);
                            subi+="별자리(황소)\n\n";
                            star_print.setText("<  별자리 (황소)  >");
                            star_print.setPaintFlags(star_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                            break;
                        }
                        else{
                            image5.setImageResource(R.drawable.aries);
                            subi+="별자리(양)\n\n";
                            star_print.setText("<  별자리 (양)  >");
                            star_print.setPaintFlags(star_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                            starview.setText(star_1);break;
                        }
                    case 5:
                        if (Integer.parseInt(getDay)>=21) {
                            starview.setText(star_3);
                            image5.setImageResource(R.drawable.gemini);
                            subi+="별자리(쌍둥이)\n\n";
                            star_print.setText("<  별자리 (쌍둥이)  >");
                            star_print.setPaintFlags(star_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                            break;
                        }
                        else{
                            subi+="별자리(황소)\n\n";
                            image5.setImageResource(R.drawable.taurus);
                            star_print.setText("<  별자리 (황소)  >");
                            star_print.setPaintFlags(star_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                            starview.setText(star_2);break;
                        }
                    case 6:
                        if (Integer.parseInt(getDay)>=22) {
                            starview.setText(star_4);
                            image5.setImageResource(R.drawable.cancer);
                            subi+="별자리(게)\n\n";
                            star_print.setText("<  별자리 (게)  >");
                            star_print.setPaintFlags(star_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                            break;
                        }
                        else{
                            image5.setImageResource(R.drawable.gemini);
                            subi+="별자리(쌍둥이)\n\n";
                            star_print.setText("<  별자리 (쌍둥이)  >");
                            star_print.setPaintFlags(star_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                            starview.setText(star_3);break;
                        }
                    case 7:
                        if (Integer.parseInt(getDay)>=23) {
                            starview.setText(star_5);
                            image5.setImageResource(R.drawable.leo);
                            subi+="별자리(사자)\n\n";
                            star_print.setText("<  별자리 (사자)  >");
                            star_print.setPaintFlags(star_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                            break;
                        }
                        else{
                            image5.setImageResource(R.drawable.cancer);
                            subi+="별자리(게)\n\n";
                            star_print.setText("<  별자리 (게)  >");
                            star_print.setPaintFlags(star_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                            starview.setText(star_4);break;
                        }
                    case 8:
                        if (Integer.parseInt(getDay)>=23) {
                            starview.setText(star_6);
                            image5.setImageResource(R.drawable.virgo);
                            subi+="별자리(처녀)\n\n";
                            star_print.setText("<  별자리 (처녀)  >");
                            star_print.setPaintFlags(star_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                            break;
                        }
                        else{
                            image5.setImageResource(R.drawable.leo);
                            subi+="별자리(사자)\n\n";
                            star_print.setText("<  별자리 (사자)  >");
                            star_print.setPaintFlags(star_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                            starview.setText(star_5);break;
                        }
                    case 9:
                        if (Integer.parseInt(getDay)>=24) {
                            starview.setText(star_7);
                            image5.setImageResource(R.drawable.libra);
                            subi+="별자리(천칭)\n\n";
                            star_print.setText("<  별자리 (천칭)  >");
                            star_print.setPaintFlags(star_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                            break;
                        }
                        else{
                            image5.setImageResource(R.drawable.virgo);
                            subi+="별자리(처녀)\n\n";
                            star_print.setText("<  별자리 (처녀)  >");
                            star_print.setPaintFlags(star_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                            starview.setText(star_6);break;
                        }
                    case 10:
                        if (Integer.parseInt(getDay)>=23) {
                            starview.setText(star_8);
                            image5.setImageResource(R.drawable.scorpio);
                            subi+="별자리(전갈)\n\n";
                            star_print.setText("<  별자리 (전갈)  >");
                            star_print.setPaintFlags(star_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                            break;
                        }
                        else{
                            image5.setImageResource(R.drawable.libra);
                            subi+="별자리(천칭)\n\n";
                            star_print.setText("<  별자리 (천칭)  >");
                            star_print.setPaintFlags(star_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                            starview.setText(star_7);break;
                        }
                    case 11:
                        if (Integer.parseInt(getDay)>=23) {
                            starview.setText(star_9);
                            image5.setImageResource(R.drawable.sagittarius);
                            subi+="별자리(사수)\n\n";
                            star_print.setText("<  별자리 (사수)  >");
                            star_print.setPaintFlags(star_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                            break;
                        }
                        else{
                            image5.setImageResource(R.drawable.scorpio);
                            subi+="별자리(전갈)\n\n";
                            star_print.setText("<  별자리 (전갈)  >");
                            star_print.setPaintFlags(star_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                            starview.setText(star_8);break;
                        }
                    case 12:
                        if (Integer.parseInt(getDay)>=25) {
                            starview.setText(star_10);
                            image5.setImageResource(R.drawable.capricorn);
                            subi+="별자리(염소)\n\n";
                            star_print.setText("<  별자리 (염소)  >");
                            star_print.setPaintFlags(star_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                            break;

                        }
                        else{
                            image5.setImageResource(R.drawable.sagittarius);
                            subi+="별자리(사수)\n\n";
                            star_print.setText("<  별자리 (사수)  >");
                            star_print.setPaintFlags(star_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                            starview.setText(star_9);break;
                        }
                    case 1:
                        if (Integer.parseInt(getDay)>=20) {
                            starview.setText(star_11);
                            image5.setImageResource(R.drawable.aquarius);
                            subi+="별자리(물병)\n\n";
                            star_print.setText("<  별자리 (물병)  >");
                            star_print.setPaintFlags(star_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                            break;
                        }
                        else{
                            image5.setImageResource(R.drawable.capricorn);
                            subi+="별자리(염소)\n\n";
                            star_print.setText("<  별자리 (염소)  >");
                            star_print.setPaintFlags(star_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                            starview.setText(star_10);break;
                        }
                    case 2:
                        if (Integer.parseInt(getDay)>=19) {
                            starview.setText(star_12);
                            image5.setImageResource(R.drawable.pisces);
                            subi+="별자리(물고기)\n\n";
                            star_print.setText("<  별자리 (물고기)  >");
                            star_print.setPaintFlags(star_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                            break;
                        }
                        else{
                            image5.setImageResource(R.drawable.aquarius);
                            subi+="별자리(물병)\n\n";
                            star_print.setText("<  별자리 (물병)  >");
                            star_print.setPaintFlags(star_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                            starview.setText(star_11);break;
                        }
                }

                //이름 도출공식
                int first_name=0;
                int last_sum=0;
                int cha_sum=0;
                int soul_sum=0;
                int des_sum=0;

                char name1=getName.charAt(0);

                if(name1 >= 0xAC00){
                    char uniVal = (char) (name1 - 0xAC00);
                    char cho = (char) (((uniVal - (uniVal % 28))/28)/21);
                    char jun = (char) (((uniVal - (uniVal % 28))/28)%21);
                    char jon = (char) (uniVal %28);

                    switch(CHO[cho]){
                        case 'ㄱ' : first_name+=1; cha_sum+=1;des_sum+=1;break;
                        case 'ㄴ' : first_name+=2; cha_sum+=2;des_sum+=2;break;
                        case 'ㄷ' : first_name+=3; cha_sum+=3;des_sum+=3;break;
                        case 'ㄹ' : first_name+=4; cha_sum+=4;des_sum+=4;break;
                        case 'ㅁ' : first_name+=5; cha_sum+=5;des_sum+=5;break;
                        case 'ㅂ' : first_name+=6; cha_sum+=6;des_sum+=6;break;
                        case 'ㅅ' : first_name+=7; cha_sum+=7;des_sum+=7;break;
                        case 'ㅇ' : first_name+=8; cha_sum+=8;des_sum+=8;break;
                        case 'ㅈ' : first_name+=9; cha_sum+=9;des_sum+=9;break;
                        case 'ㅊ' : first_name+=1; cha_sum+=1;des_sum+=1;break;
                        case 'ㅋ' : first_name+=2; cha_sum+=2;des_sum+=2;break;
                        case 'ㅌ' : first_name+=3; cha_sum+=3;des_sum+=3;break;
                        case 'ㅍ' : first_name+=4; cha_sum+=4;des_sum+=4;break;
                        case 'ㅎ' : first_name+=5; cha_sum+=5;des_sum+=5;break;
                        case 'ㄲ' : first_name+=2; cha_sum+=2;des_sum+=2;break;
                        case 'ㄸ' : first_name+=6; cha_sum+=6;des_sum+=6;break;
                        case 'ㅃ' : first_name+=12; cha_sum+=12;des_sum+=12;break;
                        case 'ㅆ' : first_name+=14; cha_sum+=14;des_sum+=14;break;
                        case 'ㅉ' : first_name+=18; cha_sum+=18;des_sum+=18;break;
                    }

                    switch(JUN[jun]){
                        case 'ㅏ': first_name+=1; soul_sum+=1;des_sum+=1;break;
                        case 'ㅐ': first_name+=2; soul_sum+=2;des_sum+=2;break;
                        case 'ㅑ': first_name+=2; soul_sum+=2;des_sum+=2;break;
                        case 'ㅒ': first_name+=3; soul_sum+=3;des_sum+=3;break;
                        case 'ㅓ': first_name+=3; soul_sum+=3;des_sum+=3;break;
                        case 'ㅔ': first_name+=4; soul_sum+=4;des_sum+=4;break;
                        case 'ㅕ': first_name+=4; soul_sum+=4;des_sum+=4;break;
                        case 'ㅖ': first_name+=5; soul_sum+=5;des_sum+=5;break;
                        case 'ㅗ': first_name+=5; soul_sum+=5;des_sum+=5;break;
                        case 'ㅘ': first_name+=6; soul_sum+=6;des_sum+=6;break;
                        case 'ㅙ': first_name+=7; soul_sum+=7;des_sum+=7;break;
                        case 'ㅚ': first_name+=6; soul_sum+=6;des_sum+=6;break;
                        case 'ㅛ': first_name+=6; soul_sum+=6;des_sum+=6;break;
                        case 'ㅜ': first_name+=7; soul_sum+=7;des_sum+=7;break;
                        case 'ㅝ': first_name+=10; soul_sum+=10;des_sum+=10;break;
                        case 'ㅞ': first_name+=11; soul_sum+=11;des_sum+=11;break;
                        case 'ㅟ': first_name+=8; soul_sum+=8;des_sum+=8;break;
                        case 'ㅠ': first_name+=8; soul_sum+=8;des_sum+=8;break;
                        case 'ㅡ': first_name+=9; soul_sum+=9;des_sum+=9;break;
                        case 'ㅣ': first_name+=1; soul_sum+=1;des_sum+=1;break;
                        case 'ㅢ': first_name+=10; soul_sum+=10;des_sum+=10;break;
                    }

                    switch(JON[jon]){
                        case 'ㄱ' : first_name+=1; cha_sum+=1;des_sum+=1;break;
                        case 'ㄴ' : first_name+=2; cha_sum+=2;des_sum+=2;break;
                        case 'ㄷ' : first_name+=3; cha_sum+=3;des_sum+=3;break;
                        case 'ㄹ' : first_name+=4; cha_sum+=4;des_sum+=4;break;
                        case 'ㅁ' : first_name+=5; cha_sum+=5;des_sum+=5;break;
                        case 'ㅂ' : first_name+=6; cha_sum+=6;des_sum+=6;break;
                        case 'ㅅ' : first_name+=7; cha_sum+=7;des_sum+=7;break;
                        case 'ㅇ' : first_name+=8; cha_sum+=8;des_sum+=8;break;
                        case 'ㅈ' : first_name+=9; cha_sum+=9;des_sum+=9;break;
                        case 'ㅊ' : first_name+=1; cha_sum+=1;des_sum+=1;break;
                        case 'ㅋ' : first_name+=2; cha_sum+=2;des_sum+=2;break;
                        case 'ㅌ' : first_name+=3; cha_sum+=3;des_sum+=3;break;
                        case 'ㅍ' : first_name+=4; cha_sum+=4;des_sum+=4;break;
                        case 'ㅎ' : first_name+=5; cha_sum+=5;des_sum+=5;break;
                        case 'ㄲ' : first_name+=2; cha_sum+=2;des_sum+=2;break;
                        case 'ㅆ' : first_name+=14; cha_sum+=14;des_sum+=14;break;
                        case 'ㄳ' : first_name+=8; cha_sum+=8;des_sum+=8;break;
                        case 'ㄵ' : first_name+=11; cha_sum+=11;des_sum+=11;break;
                        case 'ㄶ' : first_name+=7; cha_sum+=7;des_sum+=7;break;
                        case 'ㄺ' : first_name+=5; cha_sum+=5;des_sum+=5;break;
                        case 'ㄻ' : first_name+=9; cha_sum+=9;des_sum+=9;break;
                        case 'ㄽ' : first_name+=11; cha_sum+=11;des_sum+=11;break;
                        case 'ㄾ' : first_name+=7; cha_sum+=7;des_sum+=7;break;
                        case 'ㄿ' : first_name+=8; cha_sum+=8;des_sum+=8;break;
                        case 'ㅀ' : first_name+=9; cha_sum+=9;des_sum+=9;break;
                        case 'ㅄ' : first_name+=13; cha_sum+=13;des_sum+=13;break;
                    }
                }

                for(int i = 1 ; i < name.length();i++){
                    char name2 = getName.charAt(i);

                    if(name2 >= 0xAC00){
                        char uniVal = (char) (name2 - 0xAC00);

                        char cho = (char) (((uniVal - (uniVal % 28))/28)/21);
                        char jun = (char) (((uniVal - (uniVal % 28))/28)%21);
                        char jon = (char) (uniVal %28);

                        switch(CHO[cho]){
                            case 'ㄱ' : last_sum+=1; cha_sum+=1;des_sum+=1;break;
                            case 'ㄴ' : last_sum+=2; cha_sum+=2;des_sum+=2;break;
                            case 'ㄷ' : last_sum+=3; cha_sum+=3;des_sum+=3;break;
                            case 'ㄹ' : last_sum+=4; cha_sum+=4;des_sum+=4;break;
                            case 'ㅁ' : last_sum+=5; cha_sum+=5;des_sum+=5;break;
                            case 'ㅂ' : last_sum+=6; cha_sum+=6;des_sum+=6;break;
                            case 'ㅅ' : last_sum+=7; cha_sum+=7;des_sum+=7;break;
                            case 'ㅇ' : last_sum+=8; cha_sum+=8;des_sum+=8;break;
                            case 'ㅈ' : last_sum+=9; cha_sum+=9;des_sum+=9;break;
                            case 'ㅊ' : last_sum+=1; cha_sum+=1;des_sum+=1;break;
                            case 'ㅋ' : last_sum+=2; cha_sum+=2;des_sum+=2;break;
                            case 'ㅌ' : last_sum+=3; cha_sum+=3;des_sum+=3;break;
                            case 'ㅍ' : last_sum+=4; cha_sum+=4;des_sum+=4;break;
                            case 'ㅎ' : last_sum+=5; cha_sum+=5;des_sum+=5;break;
                            case 'ㄲ' : last_sum+=2; cha_sum+=2;des_sum+=2;break;
                            case 'ㄸ' : last_sum+=6; cha_sum+=6;des_sum+=6;break;
                            case 'ㅃ' : last_sum+=12; cha_sum+=12;des_sum+=12;break;
                            case 'ㅆ' : last_sum+=14; cha_sum+=14;des_sum+=14;break;
                            case 'ㅉ' : last_sum+=18; cha_sum+=18;des_sum+=18;break;
                        }

                        switch(JUN[jun]){
                            case 'ㅏ': last_sum+=1; soul_sum+=1;des_sum+=1;break;
                            case 'ㅐ': last_sum+=2; soul_sum+=2;des_sum+=2;break;
                            case 'ㅑ': last_sum+=2; soul_sum+=2;des_sum+=2;break;
                            case 'ㅒ': last_sum+=3; soul_sum+=3;des_sum+=3;break;
                            case 'ㅓ': last_sum+=3; soul_sum+=3;des_sum+=3;break;
                            case 'ㅔ': last_sum+=4; soul_sum+=4;des_sum+=4;break;
                            case 'ㅕ': last_sum+=4; soul_sum+=4;des_sum+=4;break;
                            case 'ㅖ': last_sum+=5; soul_sum+=5;des_sum+=5;break;
                            case 'ㅗ': last_sum+=5; soul_sum+=5;des_sum+=5;break;
                            case 'ㅘ': last_sum+=6; soul_sum+=6;des_sum+=6;break;
                            case 'ㅙ': last_sum+=7; soul_sum+=7;des_sum+=7;break;
                            case 'ㅚ': last_sum+=6; soul_sum+=6;des_sum+=6;break;
                            case 'ㅛ': last_sum+=6; soul_sum+=6;des_sum+=6;break;
                            case 'ㅜ': last_sum+=7; soul_sum+=7;des_sum+=7;break;
                            case 'ㅝ': last_sum+=10; soul_sum+=10;des_sum+=10;break;
                            case 'ㅞ': last_sum+=11; soul_sum+=11;des_sum+=11;break;
                            case 'ㅟ': last_sum+=8; soul_sum+=8;des_sum+=8;break;
                            case 'ㅠ': last_sum+=8; soul_sum+=8;des_sum+=8;break;
                            case 'ㅡ': last_sum+=9; soul_sum+=9;des_sum+=9;break;
                            case 'ㅣ': last_sum+=1; soul_sum+=1;des_sum+=1;break;
                            case 'ㅢ': last_sum+=10; soul_sum+=10;des_sum+=10;break;
                        }

                        switch(JON[jon]){
                            case 'ㄱ' : last_sum+=1; cha_sum+=1;des_sum+=1;break;
                            case 'ㄴ' : last_sum+=2; cha_sum+=2;des_sum+=2;break;
                            case 'ㄷ' : last_sum+=3; cha_sum+=3;des_sum+=3;break;
                            case 'ㄹ' : last_sum+=4; cha_sum+=4;des_sum+=4;break;
                            case 'ㅁ' : last_sum+=5; cha_sum+=5;des_sum+=5;break;
                            case 'ㅂ' : last_sum+=6; cha_sum+=6;des_sum+=6;break;
                            case 'ㅅ' : last_sum+=7; cha_sum+=7;des_sum+=7;break;
                            case 'ㅇ' : last_sum+=8; cha_sum+=8;des_sum+=8;break;
                            case 'ㅈ' : last_sum+=9; cha_sum+=9;des_sum+=9;break;
                            case 'ㅊ' : last_sum+=1; cha_sum+=1;des_sum+=1;break;
                            case 'ㅋ' : last_sum+=2; cha_sum+=2;des_sum+=2;break;
                            case 'ㅌ' : last_sum+=3; cha_sum+=3;des_sum+=3;break;
                            case 'ㅍ' : last_sum+=4; cha_sum+=4;des_sum+=4;break;
                            case 'ㅎ' : last_sum+=5; cha_sum+=5;des_sum+=5;break;
                            case 'ㄲ' : last_sum+=2; cha_sum+=2;des_sum+=2;break;
                            case 'ㅆ' : last_sum+=14; cha_sum+=14;des_sum+=14;break;
                            case 'ㄳ' : last_sum+=8; cha_sum+=8;des_sum+=8;break;
                            case 'ㄵ' : last_sum+=11; cha_sum+=11;des_sum+=11;break;
                            case 'ㄶ' : last_sum+=7; cha_sum+=7;des_sum+=7;break;
                            case 'ㄺ' : last_sum+=5; cha_sum+=5;des_sum+=5;break;
                            case 'ㄻ' : last_sum+=9; cha_sum+=9;des_sum+=9;break;
                            case 'ㄽ' : last_sum+=11; cha_sum+=11;des_sum+=11;break;
                            case 'ㄾ' : last_sum+=7; cha_sum+=7;des_sum+=7;break;
                            case 'ㄿ' : last_sum+=8; cha_sum+=8;des_sum+=8;break;
                            case 'ㅀ' : last_sum+=9; cha_sum+=9;des_sum+=9;break;
                            case 'ㅄ' : last_sum+=13; cha_sum+=13;des_sum+=13;break;
                        }
                    }
                }

                TextView first = (TextView)findViewById(R.id.first);
                TextView last = (TextView)findViewById(R.id.last);
                TextView soul1 = (TextView)findViewById(R.id.soul);
                TextView cha = (TextView)findViewById(R.id.cha);
                TextView des = (TextView)findViewById(R.id.des);
                TextView life = (TextView)findViewById(R.id.life);
                TextView comp = (TextView)findViewById(R.id.comp);
                TextView subi1 = (TextView)findViewById(R.id.subi);


                int cha_final=cha_sum;
                while(true){
                    if(cha_final == 11 || cha_final==22){break;}
                    else if(cha_final<10){break;}
                    else{
                        String e=Integer.toString(cha_final);
                        cha_final=((int)e.charAt(0)-48)+((int)e.charAt(1)-48);
                    }
                }
                subi+="▶성격수("+Integer.toString(cha_final)+")  ";

                cha_print.setText("<  성격수 ("+Integer.toString(cha_final)+")  >");
                cha_print.setPaintFlags(cha_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

                switch(cha_final){
                    case 1: cha.setText(cha_1);break;
                    case 2: cha.setText(cha_2);break;
                    case 3: cha.setText(cha_3);break;
                    case 4: cha.setText(cha_4);break;
                    case 5: cha.setText(cha_5);break;
                    case 6: cha.setText(cha_6);break;
                    case 7: cha.setText(cha_7);break;
                    case 8: cha.setText(cha_8);break;
                    case 9: cha.setText(cha_9);break;
                    case 11: cha.setText(cha_11);break;
                    case 22: cha.setText(cha_22);break;
                }

                int soul_sum2=soul_sum;
                while(true){
                    if(soul_sum2 == 11 || soul_sum2==22 || soul_sum2==33){break;}
                    else if(soul_sum2<10){break;}
                    else{
                        String w=Integer.toString(soul_sum2);
                        soul_sum2=((int)w.charAt(0)-48)+((int)w.charAt(1)-48);
                    }
                }
                subi+="혼의수("+Integer.toString(soul_sum2)+")  ";
                soul2_print.setText("<  혼의수 ("+Integer.toString(soul_sum2)+")  >");
                soul2_print.setPaintFlags(soul2_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

                switch(soul_sum2){
                    case 1: soul1.setText(soul_1);break;
                    case 2: soul1.setText(soul_2);break;
                    case 3: soul1.setText(soul_3);break;
                    case 4: soul1.setText(soul_4);break;
                    case 5: soul1.setText(soul_5);break;
                    case 6: soul1.setText(soul_6);break;
                    case 7: soul1.setText(soul_7);break;
                    case 8: soul1.setText(soul_8);break;
                    case 9: soul1.setText(soul_9);break;
                    case 11: soul1.setText(soul_11);break;
                    case 22: soul1.setText(soul_22);break;
                    case 33: soul1.setText(soul_33);break;
                }

                int final_des=des_sum;
                while(true){
                    if(final_des == 11 || final_des==22 || final_des==33){break;}
                    else if(final_des<10){break;}
                    else{
                        String e=Integer.toString(final_des);
                        final_des=((int)e.charAt(0)-48)+((int)e.charAt(1)-48);
                    }
                }

                subi+="운명수("+Integer.toString(final_des)+")\n\n";
                des_print.setText("<  운명수 ("+Integer.toString(final_des)+")  >");
                des_print.setPaintFlags(des_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                switch(final_des){
                    case 1: des.setText(des_1);break;
                    case 2: des.setText(des_2);break;
                    case 3: des.setText(des_3);break;
                    case 4: des.setText(des_4);break;
                    case 5: des.setText(des_5);break;
                    case 6: des.setText(des_6);break;
                    case 7: des.setText(des_7);break;
                    case 8: des.setText(des_8);break;
                    case 9: des.setText(des_9);break;
                    case 11: des.setText(des_11);break;
                    case 22: des.setText(des_22);break;
                    case 33: des.setText(des_33);break;
                }

                String o=Integer.toString(year_month_day);
                int year_month_day_sum=((int)o.charAt(0)-48)+((int)o.charAt(1)-48+(int)o.charAt(2)-48)+((int)o.charAt(3)-48);
                while(true){
                    if(year_month_day_sum == 11 || year_month_day_sum==22){break;}
                    else if(year_month_day_sum<10){break;}
                    else{
                        String e=Integer.toString(year_month_day_sum);
                        year_month_day_sum=((int)e.charAt(0)-48)+((int)e.charAt(1)-48);
                    }
                }
                subi+="▶인생여정수("+Integer.toString(year_month_day_sum)+")  ";
                life_print.setText("<  인생여정수 ("+Integer.toString(year_month_day_sum)+")  >");
                life_print.setPaintFlags(life_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

                switch(year_month_day_sum){
                    case 1: life.setText(life_1);break;
                    case 2: life.setText(life_2);break;
                    case 3: life.setText(life_3);break;
                    case 4: life.setText(life_4);break;
                    case 5: life.setText(life_5);break;
                    case 6: life.setText(life_6);break;
                    case 7: life.setText(life_7);break;
                    case 8: life.setText(life_8);break;
                    case 9: life.setText(life_9);break;
                    case 11: life.setText(life_11);break;
                    case 22: life.setText(life_22);break;
                }

                int comp_sum=year_month_day_sum+final_des;
                while(true){
                    if(comp_sum == 11 || comp_sum==22 || comp_sum==33){break;}
                    else if(comp_sum<10){break;}
                    else{
                        String m=Integer.toString(comp_sum);
                        comp_sum=((int)m.charAt(0)-48)+((int)m.charAt(1)-48);
                    }
                }
                subi+="완성수("+Integer.toString(comp_sum)+")  ";

                comp_print.setText("<  완성수 ("+Integer.toString(comp_sum)+")  >");
                comp_print.setPaintFlags(comp_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

                switch(comp_sum){
                    case 1: comp.setText(comp_1);break;
                    case 2: comp.setText(comp_2);break;
                    case 3: comp.setText(comp_3);break;
                    case 4: comp.setText(comp_4);break;
                    case 5: comp.setText(comp_5);break;
                    case 6: comp.setText(comp_6);break;
                    case 7: comp.setText(comp_7);break;
                    case 8: comp.setText(comp_8);break;
                    case 9: comp.setText(comp_9);break;
                    case 11: comp.setText(comp_11);break;
                    case 22: comp.setText(comp_22);break;
                    case 33: comp.setText(comp_33);break;
                }

                int last_name_sum=last_sum;
                while(true){
                    if(last_name_sum == 11 || last_name_sum==22 || last_name_sum==33){break;}
                    else if(last_name_sum<10){break;}
                    else{
                        String w=Integer.toString(last_name_sum);
                        last_name_sum=((int)w.charAt(0)-48)+((int)w.charAt(1)-48);
                    }
                }
                subi+="성장수("+Integer.toString(last_name_sum)+")  ";
                grow_print.setText("<  성장수 ("+Integer.toString(last_name_sum)+")  >");
                grow_print.setPaintFlags(grow_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                switch(last_name_sum){
                    case 1: last.setText(grow_1);break;
                    case 2: last.setText(grow_2);break;
                    case 3: last.setText(grow_3);break;
                    case 4: last.setText(grow_4);break;
                    case 5: last.setText(grow_5);break;
                    case 6: last.setText(grow_6);break;
                    case 7: last.setText(grow_7);break;
                    case 8: last.setText(grow_8);break;
                    case 9: last.setText(grow_9);break;
                    case 11: last.setText(grow_11);break;
                    case 22: last.setText(grow_22);break;
                    case 33: last.setText(grow_33);break;
                }

                int first_name_sum=first_name;
                if (first_name_sum>10){
                    String q=Integer.toString(first_name_sum);
                    first_name_sum=((int)q.charAt(0)-48)+((int)q.charAt(1)-48);
                }
                subi+="성姓("+Integer.toString(first_name_sum)+")\n";

                sex_print.setText("<  성姓 ("+Integer.toString(last_name_sum)+")  >");
                sex_print.setPaintFlags(sex_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

                switch(first_name_sum){
                    case 1: first.setText(first_1);break;
                    case 2: first.setText(first_2);break;
                    case 3: first.setText(first_3);break;
                    case 4: first.setText(first_4);break;
                    case 5: first.setText(first_5);break;
                    case 6: first.setText(first_6);break;
                    case 7: first.setText(first_7);break;
                    case 8: first.setText(first_8);break;
                    case 9: first.setText(first_9);break;
                }
                subi1.setText(subi);

                int year_number= Integer.parseInt(getYear);
                int year_number2=Integer.parseInt(getCalendar);
                int year_numbering=list[year_number2-year_number];

                int year_final=year_numbering;
                while(true){

                    if(year_final<10){break;}
                    else{
                        String e=Integer.toString(year_final);
                        year_final=((int)e.charAt(0)-48)+((int)e.charAt(1)-48);
                    }
                }
                final int year_final2=year_final;
                switch(year_final){
                    case 1:year_print.setText("<  1년수 ("+Integer.toString(year_final)+")  >");year_print.setPaintFlags(year_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                        year_number_print.setText(year_1);break;
                    case 2:year_print.setText("<  1년수 ("+Integer.toString(year_final)+")  >");year_print.setPaintFlags(year_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                        year_number_print.setText(year_2);break;
                    case 3:year_print.setText("<  1년수 ("+Integer.toString(year_final)+")  >");year_print.setPaintFlags(year_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                        year_number_print.setText(year_3);break;
                    case 4:year_print.setText("<  1년수 ("+Integer.toString(year_final)+")  >");year_print.setPaintFlags(year_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                        year_number_print.setText(year_4);break;
                    case 5:year_print.setText("<  1년수 ("+Integer.toString(year_final)+")  >");year_print.setPaintFlags(year_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                        year_number_print.setText(year_5);break;
                    case 6:year_print.setText("<  1년수 ("+Integer.toString(year_final)+")  >");year_print.setPaintFlags(year_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                        year_number_print.setText(year_6);break;
                    case 7:year_print.setText("<  1년수 ("+Integer.toString(year_final)+")  >");year_print.setPaintFlags(year_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                        year_number_print.setText(year_7);break;
                    case 8:year_print.setText("<  1년수 ("+Integer.toString(year_final)+")  >");year_print.setPaintFlags(year_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                        year_number_print.setText(year_8);break;
                    case 9:year_print.setText("<  1년수 ("+Integer.toString(year_final)+")  >");year_print.setPaintFlags(year_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                        year_number_print.setText(year_9); break;
                }

                spinner = (Spinner) findViewById(R.id.spinner);
                spinner2 = (Spinner) findViewById(R.id.spinner2);

                String[] list2 = new String[9];
                list2[0]="나이 선택";
                list2[1] = "[  1~10 ]";
                list2[2] = "[ 11~20 ]";
                list2[3] = "[ 21~30 ]";
                list2[4] = "[ 31~40 ]";
                list2[5] = "[ 41~50 ]";
                list2[6] = "[ 51~60 ]";
                list2[7] = "[ 61~70 ]";
                list2[8] = "[ 71~80 ]";

                String[] list3 = new String[13];
                list3[0]="월 선택";
                list3[1] = "1월";
                list3[2] = "2월";
                list3[3] = "3월";
                list3[4] = "4월";
                list3[5] = "5월";
                list3[6] = "6월";
                list3[7] = "7월";
                list3[8] = "8월";
                list3[9] = "9월";
                list3[10] = "10월";
                list3[11] = "11월";
                list3[12] = "12월";

                ArrayAdapter spinnerAdapter = new ArrayAdapter(MainActivity.this, R.layout.support_simple_spinner_dropdown_item, list2);
                spinner.setAdapter(spinnerAdapter);
                ArrayAdapter spinnerAdapter2 = new ArrayAdapter(MainActivity.this, R.layout.support_simple_spinner_dropdown_item, list3);
                spinner2.setAdapter(spinnerAdapter2);
                spinner.setOnItemSelectedListener(new AdapterView.OnItemSelectedListener() {
                    @Override
                    public void onItemSelected(AdapterView<?> parent, View view, int position, long id) {
                        ImageView image1 = (ImageView) findViewById(R.id.image_1);


                        if(spinner.getItemAtPosition(position).equals("[  1~10 ]")){

                            Bitmap graph=BitmapFactory.decodeResource(getResources(), R.drawable.a1);
                            Bitmap point=BitmapFactory.decodeResource(getResources(), R.drawable.point);

                            double wid = graph.getWidth()/1000.0;
                            double hei=graph.getHeight()/1200.0;


                            Bitmap bmOverlay = Bitmap.createBitmap(graph.getWidth(),graph.getHeight(), graph.getConfig());
                            Canvas canvas = new Canvas(bmOverlay);
                            canvas.drawBitmap(graph, 0, 0, null);
                            //1
                            for(int i=0;i<10;i++){
                                canvas.drawBitmap(point, (int)Math.round(wid*(200+i*83)), (int)Math.round(hei*(72+(list[i]-1)*52)), null);
                            }

                            image1.setImageDrawable(new BitmapDrawable(getResources(), bmOverlay));
                        }

                        if(spinner.getItemAtPosition(position).equals("[ 11~20 ]")){

                            Bitmap graph=BitmapFactory.decodeResource(getResources(), R.drawable.a2);
                            Bitmap point=BitmapFactory.decodeResource(getResources(), R.drawable.point);

                            double wid = graph.getWidth()/1000.0;
                            double hei=graph.getHeight()/1200.0;


                            Bitmap bmOverlay = Bitmap.createBitmap(graph.getWidth(),graph.getHeight(), graph.getConfig());
                            Canvas canvas = new Canvas(bmOverlay);
                            canvas.drawBitmap(graph, 0, 0, null);
                            //1
                            for(int i=0;i<10;i++){
                                canvas.drawBitmap(point, (int)Math.round(wid*(200+i*83)), (int)Math.round(hei*(72+(list[i+10]-1)*52)), null);
                            }

                            image1.setImageDrawable(new BitmapDrawable(getResources(), bmOverlay));
                        }

                        if(spinner.getItemAtPosition(position).equals("[ 21~30 ]")){

                            Bitmap graph=BitmapFactory.decodeResource(getResources(), R.drawable.a3);
                            Bitmap point=BitmapFactory.decodeResource(getResources(), R.drawable.point);

                            double wid = graph.getWidth()/1000.0;
                            double hei=graph.getHeight()/1200.0;


                            Bitmap bmOverlay = Bitmap.createBitmap(graph.getWidth(),graph.getHeight(), graph.getConfig());
                            Canvas canvas = new Canvas(bmOverlay);
                            canvas.drawBitmap(graph, 0, 0, null);
                            //1
                            for(int i=0;i<10;i++){
                                canvas.drawBitmap(point, (int)Math.round(wid*(200+i*83)), (int)Math.round(hei*(72+(list[i+20]-1)*52)), null);
                            }

                            image1.setImageDrawable(new BitmapDrawable(getResources(), bmOverlay));
                        }

                        if(spinner.getItemAtPosition(position).equals("[ 31~40 ]")){

                            Bitmap graph=BitmapFactory.decodeResource(getResources(), R.drawable.a4);
                            Bitmap point=BitmapFactory.decodeResource(getResources(), R.drawable.point);

                            double wid = graph.getWidth()/1000.0;
                            double hei=graph.getHeight()/1200.0;


                            Bitmap bmOverlay = Bitmap.createBitmap(graph.getWidth(),graph.getHeight(), graph.getConfig());
                            Canvas canvas = new Canvas(bmOverlay);
                            canvas.drawBitmap(graph, 0, 0, null);
                            //1
                            for(int i=0;i<10;i++){
                                canvas.drawBitmap(point, (int)Math.round(wid*(200+i*83)), (int)Math.round(hei*(72+(list[i+30]-1)*52)), null);
                            }

                            image1.setImageDrawable(new BitmapDrawable(getResources(), bmOverlay));
                        }

                        if(spinner.getItemAtPosition(position).equals("[ 41~50 ]")){

                            Bitmap graph=BitmapFactory.decodeResource(getResources(), R.drawable.a5);
                            Bitmap point=BitmapFactory.decodeResource(getResources(), R.drawable.point);

                            double wid = graph.getWidth()/1000.0;
                            double hei=graph.getHeight()/1200.0;


                            Bitmap bmOverlay = Bitmap.createBitmap(graph.getWidth(),graph.getHeight(), graph.getConfig());
                            Canvas canvas = new Canvas(bmOverlay);
                            canvas.drawBitmap(graph, 0, 0, null);
                            //1
                            for(int i=0;i<10;i++){
                                canvas.drawBitmap(point, (int)Math.round(wid*(200+i*83)), (int)Math.round(hei*(72+(list[i+40]-1)*52)), null);
                            }

                            image1.setImageDrawable(new BitmapDrawable(getResources(), bmOverlay));
                        }

                        if(spinner.getItemAtPosition(position).equals("[ 51~60 ]")){

                            Bitmap graph=BitmapFactory.decodeResource(getResources(), R.drawable.a6);
                            Bitmap point=BitmapFactory.decodeResource(getResources(), R.drawable.point);

                            double wid = graph.getWidth()/1000.0;
                            double hei=graph.getHeight()/1200.0;


                            Bitmap bmOverlay = Bitmap.createBitmap(graph.getWidth(),graph.getHeight(), graph.getConfig());
                            Canvas canvas = new Canvas(bmOverlay);
                            canvas.drawBitmap(graph, 0, 0, null);
                            //1
                            for(int i=0;i<10;i++){
                                canvas.drawBitmap(point, (int)Math.round(wid*(200+i*83)), (int)Math.round(hei*(72+(list[i+50]-1)*52)), null);
                            }

                            image1.setImageDrawable(new BitmapDrawable(getResources(), bmOverlay));
                        }

                        if(spinner.getItemAtPosition(position).equals("[ 61~70 ]")){

                            Bitmap graph=BitmapFactory.decodeResource(getResources(), R.drawable.a7);
                            Bitmap point=BitmapFactory.decodeResource(getResources(), R.drawable.point);

                            double wid = graph.getWidth()/1000.0;
                            double hei=graph.getHeight()/1200.0;


                            Bitmap bmOverlay = Bitmap.createBitmap(graph.getWidth(),graph.getHeight(), graph.getConfig());
                            Canvas canvas = new Canvas(bmOverlay);
                            canvas.drawBitmap(graph, 0, 0, null);
                            //1
                            for(int i=0;i<10;i++){
                                canvas.drawBitmap(point, (int)Math.round(wid*(200+i*83)), (int)Math.round(hei*(72+(list[i+60]-1)*52)), null);
                            }

                            image1.setImageDrawable(new BitmapDrawable(getResources(), bmOverlay));
                        }

                        if(spinner.getItemAtPosition(position).equals("[ 71~80 ]")){

                            Bitmap graph=BitmapFactory.decodeResource(getResources(), R.drawable.a8);
                            Bitmap point=BitmapFactory.decodeResource(getResources(), R.drawable.point);

                            double wid = graph.getWidth()/1000.0;
                            double hei=graph.getHeight()/1200.0;


                            Bitmap bmOverlay = Bitmap.createBitmap(graph.getWidth(),graph.getHeight(), graph.getConfig());
                            Canvas canvas = new Canvas(bmOverlay);
                            canvas.drawBitmap(graph, 0, 0, null);
                            //1
                            for(int i=0;i<10;i++){
                                canvas.drawBitmap(point, (int)Math.round(wid*(200+i*83)), (int)Math.round(hei*(72+(list[i+70]-1)*52)), null);
                            }

                            image1.setImageDrawable(new BitmapDrawable(getResources(), bmOverlay));
                        }

                    }
                    @Override
                    public void onNothingSelected(AdapterView<?> parent) {}
                });

                spinner2.setOnItemSelectedListener(new AdapterView.OnItemSelectedListener() {
                    @Override
                    public void onItemSelected(AdapterView<?> parent, View view, int position, long id) {

                        if (spinner2.getItemAtPosition(position).equals("1월")) {
                            calendar_print_123.setText("< 1월 달력 >");
                            calendar_print_123.setPaintFlags(calendar_print_123.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                            int month_number = 1 + year_final2;
                            int month_final = month_number;
                            while (true) {
                                if (month_final < 10) {
                                    break;
                                } else {
                                    String e = Integer.toString(month_final);
                                    month_final = ((int) e.charAt(0) - 48) + ((int) e.charAt(1) - 48);
                                }
                            }
                            month_print.setText("<  1월수 (" + Integer.toString(month_final) + ")  >");
                            month_print.setPaintFlags(month_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

                            switch (month_final) {
                                case 1:
                                    month_number_print.setText(month_1);
                                    break;
                                case 2:
                                    month_number_print.setText(month_2);
                                    break;
                                case 3:
                                    month_number_print.setText(month_3);
                                    break;
                                case 4:
                                    month_number_print.setText(month_4);
                                    break;
                                case 5:
                                    month_number_print.setText(month_5);
                                    break;
                                case 6:
                                    month_number_print.setText(month_6);
                                    break;
                                case 7:
                                    month_number_print.setText(month_7);
                                    break;
                                case 8:
                                    month_number_print.setText(month_8);
                                    break;
                                case 9:
                                    month_number_print.setText(month_9);
                                    break;
                            }
                            int DECRESE_MONTH = -1;
                            int INCRESE_MONTH = +1;
                            int NOTHING_MONTH_MODE = 0;
                            int COUNT_DAY_NUMBER_IN_WEEK = 7;
                            int monthChangeType = 0;
                            int currentMonth;
                            int numberOfStartDate;
                            int numberOfEndDate;
                            int weekNumberInCurrentMonth;
                            Calendar cal;
                            int currentYear = Integer.parseInt(getCalendar);
                            currentMonth = 0;
                            cal = Calendar.getInstance();
                            cal.set(currentYear, currentMonth, 1);
                            if(monthChangeType == DECRESE_MONTH) cal.add(Calendar.MONTH, DECRESE_MONTH);
                            if(monthChangeType == INCRESE_MONTH) cal.add(Calendar.MONTH, INCRESE_MONTH);
                            numberOfStartDate = cal.get(Calendar.DAY_OF_WEEK);
                            numberOfEndDate = cal.getActualMaximum(Calendar.DATE);
                            cal.set(Calendar.DATE, numberOfEndDate);
                            weekNumberInCurrentMonth = cal.get(Calendar.WEEK_OF_MONTH);
                            String calendar2="  ";
                            int count=0;
                            int loopCount = COUNT_DAY_NUMBER_IN_WEEK * weekNumberInCurrentMonth;
                            for(int i=0, printDay=1; i<loopCount;i++) {
                                if(i < numberOfStartDate || printDay > numberOfEndDate)
                                    count+=1;
                            }

                            switch(count){
                                case 1:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.sun311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.sun312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.sun313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.sun314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.sun315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.sun316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.sun317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.sun318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.sun319);break;
                                    }break;
                                case 2:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.mon311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.mon312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.mon313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.mon314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.mon315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.mon316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.mon317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.mon318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.mon319);break;
                                    }break;
                                case 3:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.tue311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.tue312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.tue313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.tue314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.tue315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.tue316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.tue317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.tue318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.tue319);break;
                                    }break;
                                case 4:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.wed311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.wed312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.wed313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.wed314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.wed315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.wed316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.wed317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.wed318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.wed319);break;
                                    }break;
                                case 5:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.thu311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.thu312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.thu313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.thu314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.thu315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.thu316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.thu317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.thu318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.thu319);break;
                                    }break;
                                case 6:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.fir311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.fir312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.fir313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.fir314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.fir315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.fir316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.fir317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.fir318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.fir319);break;
                                    }break;
                                case 7:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.sat311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.sat312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.sat313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.sat314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.sat315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.sat316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.sat317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.sat318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.sat319);break;
                                    }break;
                            }
                        }

                        if (spinner2.getItemAtPosition(position).equals("2월")) {
                            calendar_print_123.setText("< 2월 달력 >");
                            calendar_print_123.setPaintFlags(calendar_print_123.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

                            int month_number = 2 + year_final2;

                            int month_final = month_number;
                            while (true) {

                                if (month_final < 10) {
                                    break;
                                } else {
                                    String e = Integer.toString(month_final);
                                    month_final = ((int) e.charAt(0) - 48) + ((int) e.charAt(1) - 48);
                                }
                            }
                            month_print.setText("<  1월수 (" + Integer.toString(month_final) + ")  >");
                            month_print.setPaintFlags(month_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

                            switch (month_final) {
                                case 1:
                                    month_number_print.setText(month_1);
                                    break;
                                case 2:
                                    month_number_print.setText(month_2);
                                    break;
                                case 3:
                                    month_number_print.setText(month_3);
                                    break;
                                case 4:
                                    month_number_print.setText(month_4);
                                    break;
                                case 5:
                                    month_number_print.setText(month_5);
                                    break;
                                case 6:
                                    month_number_print.setText(month_6);
                                    break;
                                case 7:
                                    month_number_print.setText(month_7);
                                    break;
                                case 8:
                                    month_number_print.setText(month_8);
                                    break;
                                case 9:
                                    month_number_print.setText(month_9);
                                    break;
                            }

                            int DECRESE_MONTH = -1;
                            int INCRESE_MONTH = +1;
                            int NOTHING_MONTH_MODE = 0;
                            int COUNT_DAY_NUMBER_IN_WEEK = 7;
                            int monthChangeType = 0;
                            int currentMonth;
                            int numberOfStartDate;
                            int numberOfEndDate;
                            int weekNumberInCurrentMonth;
                            Calendar cal;
                            int currentYear = Integer.parseInt(getCalendar);
                            currentMonth = 1;

                            cal = Calendar.getInstance();
                            cal.set(currentYear, currentMonth, 1);
                            if(monthChangeType == DECRESE_MONTH) cal.add(Calendar.MONTH, DECRESE_MONTH);
                            if(monthChangeType == INCRESE_MONTH) cal.add(Calendar.MONTH, INCRESE_MONTH);
                            numberOfStartDate = cal.get(Calendar.DAY_OF_WEEK);
                            numberOfEndDate = cal.getActualMaximum(Calendar.DATE);
                            cal.set(Calendar.DATE, numberOfEndDate);
                            weekNumberInCurrentMonth = cal.get(Calendar.WEEK_OF_MONTH);

                            String calendar2="  ";
                            int count=0;
                            int loopCount = COUNT_DAY_NUMBER_IN_WEEK * weekNumberInCurrentMonth;
                            for(int i=0, printDay=1; i<loopCount;i++) {
                                if(i < numberOfStartDate || printDay > numberOfEndDate)
                                    count+=1;
                            }

                            if((currentYear%4==0 && currentYear%100 != 0) || currentYear %400==0){
                                switch(count){
                                    case 1:
                                        switch(month_final){
                                            case 1:calendar_image.setImageResource(R.drawable.sun291);break;
                                            case 2:calendar_image.setImageResource(R.drawable.sun292);break;
                                            case 3:calendar_image.setImageResource(R.drawable.sun293);break;
                                            case 4:calendar_image.setImageResource(R.drawable.sun294);break;
                                            case 5:calendar_image.setImageResource(R.drawable.sun295);break;
                                            case 6:calendar_image.setImageResource(R.drawable.sun296);break;
                                            case 7:calendar_image.setImageResource(R.drawable.sun297);break;
                                            case 8:calendar_image.setImageResource(R.drawable.sun298);break;
                                            case 9:calendar_image.setImageResource(R.drawable.sun299);break;
                                        }break;
                                    case 2:
                                        switch(month_final){
                                            case 1:calendar_image.setImageResource(R.drawable.mon291);break;
                                            case 2:calendar_image.setImageResource(R.drawable.mon292);break;
                                            case 3:calendar_image.setImageResource(R.drawable.mon293);break;
                                            case 4:calendar_image.setImageResource(R.drawable.mon294);break;
                                            case 5:calendar_image.setImageResource(R.drawable.mon295);break;
                                            case 6:calendar_image.setImageResource(R.drawable.mon296);break;
                                            case 7:calendar_image.setImageResource(R.drawable.mon297);break;
                                            case 8:calendar_image.setImageResource(R.drawable.mon298);break;
                                            case 9:calendar_image.setImageResource(R.drawable.mon299);break;
                                        }break;
                                    case 3:
                                        switch(month_final){
                                            case 1:calendar_image.setImageResource(R.drawable.tue291);break;
                                            case 2:calendar_image.setImageResource(R.drawable.tue292);break;
                                            case 3:calendar_image.setImageResource(R.drawable.tue293);break;
                                            case 4:calendar_image.setImageResource(R.drawable.tue294);break;
                                            case 5:calendar_image.setImageResource(R.drawable.tue295);break;
                                            case 6:calendar_image.setImageResource(R.drawable.tue296);break;
                                            case 7:calendar_image.setImageResource(R.drawable.tue297);break;
                                            case 8:calendar_image.setImageResource(R.drawable.tue298);break;
                                            case 9:calendar_image.setImageResource(R.drawable.tue299);break;
                                        }break;
                                    case 4:
                                        switch(month_final){
                                            case 1:calendar_image.setImageResource(R.drawable.wed291);break;
                                            case 2:calendar_image.setImageResource(R.drawable.wed292);break;
                                            case 3:calendar_image.setImageResource(R.drawable.wed293);break;
                                            case 4:calendar_image.setImageResource(R.drawable.wed294);break;
                                            case 5:calendar_image.setImageResource(R.drawable.wed295);break;
                                            case 6:calendar_image.setImageResource(R.drawable.wed296);break;
                                            case 7:calendar_image.setImageResource(R.drawable.wed297);break;
                                            case 8:calendar_image.setImageResource(R.drawable.wed298);break;
                                            case 9:calendar_image.setImageResource(R.drawable.wed299);break;
                                        }break;
                                    case 5:
                                        switch(month_final){
                                            case 1:calendar_image.setImageResource(R.drawable.thu291);break;
                                            case 2:calendar_image.setImageResource(R.drawable.thu292);break;
                                            case 3:calendar_image.setImageResource(R.drawable.thu293);break;
                                            case 4:calendar_image.setImageResource(R.drawable.thu294);break;
                                            case 5:calendar_image.setImageResource(R.drawable.thu295);break;
                                            case 6:calendar_image.setImageResource(R.drawable.thu296);break;
                                            case 7:calendar_image.setImageResource(R.drawable.thu297);break;
                                            case 8:calendar_image.setImageResource(R.drawable.thu298);break;
                                            case 9:calendar_image.setImageResource(R.drawable.thu299);break;
                                        }break;
                                    case 6:
                                        switch(month_final){
                                            case 1:calendar_image.setImageResource(R.drawable.fir291);break;
                                            case 2:calendar_image.setImageResource(R.drawable.fir292);break;
                                            case 3:calendar_image.setImageResource(R.drawable.fir293);break;
                                            case 4:calendar_image.setImageResource(R.drawable.fir294);break;
                                            case 5:calendar_image.setImageResource(R.drawable.fir295);break;
                                            case 6:calendar_image.setImageResource(R.drawable.fir296);break;
                                            case 7:calendar_image.setImageResource(R.drawable.fir297);break;
                                            case 8:calendar_image.setImageResource(R.drawable.fir298);break;
                                            case 9:calendar_image.setImageResource(R.drawable.fir299);break;
                                        }break;
                                    case 7:
                                        switch(month_final){
                                            case 1:calendar_image.setImageResource(R.drawable.sat291);break;
                                            case 2:calendar_image.setImageResource(R.drawable.sat292);break;
                                            case 3:calendar_image.setImageResource(R.drawable.sat293);break;
                                            case 4:calendar_image.setImageResource(R.drawable.sat294);break;
                                            case 5:calendar_image.setImageResource(R.drawable.sat295);break;
                                            case 6:calendar_image.setImageResource(R.drawable.sat296);break;
                                            case 7:calendar_image.setImageResource(R.drawable.sat297);break;
                                            case 8:calendar_image.setImageResource(R.drawable.sat298);break;
                                            case 9:calendar_image.setImageResource(R.drawable.sat299);break;
                                        }break;
                                }
                            }
                            else{
                                switch(count){
                                    case 1:
                                        switch(month_final){
                                            case 1:calendar_image.setImageResource(R.drawable.sun281);break;
                                            case 2:calendar_image.setImageResource(R.drawable.sun282);break;
                                            case 3:calendar_image.setImageResource(R.drawable.sun283);break;
                                            case 4:calendar_image.setImageResource(R.drawable.sun284);break;
                                            case 5:calendar_image.setImageResource(R.drawable.sun285);break;
                                            case 6:calendar_image.setImageResource(R.drawable.sun286);break;
                                            case 7:calendar_image.setImageResource(R.drawable.sun287);break;
                                            case 8:calendar_image.setImageResource(R.drawable.sun288);break;
                                            case 9:calendar_image.setImageResource(R.drawable.sun289);break;
                                        }break;
                                    case 2:
                                        switch(month_final){
                                            case 1:calendar_image.setImageResource(R.drawable.mon281);break;
                                            case 2:calendar_image.setImageResource(R.drawable.mon282);break;
                                            case 3:calendar_image.setImageResource(R.drawable.mon283);break;
                                            case 4:calendar_image.setImageResource(R.drawable.mon284);break;
                                            case 5:calendar_image.setImageResource(R.drawable.mon285);break;
                                            case 6:calendar_image.setImageResource(R.drawable.mon286);break;
                                            case 7:calendar_image.setImageResource(R.drawable.mon287);break;
                                            case 8:calendar_image.setImageResource(R.drawable.mon288);break;
                                            case 9:calendar_image.setImageResource(R.drawable.mon289);break;
                                        }break;
                                    case 3:
                                        switch(month_final){
                                            case 1:calendar_image.setImageResource(R.drawable.tue281);break;
                                            case 2:calendar_image.setImageResource(R.drawable.tue282);break;
                                            case 3:calendar_image.setImageResource(R.drawable.tue283);break;
                                            case 4:calendar_image.setImageResource(R.drawable.tue284);break;
                                            case 5:calendar_image.setImageResource(R.drawable.tue285);break;
                                            case 6:calendar_image.setImageResource(R.drawable.tue286);break;
                                            case 7:calendar_image.setImageResource(R.drawable.tue287);break;
                                            case 8:calendar_image.setImageResource(R.drawable.tue288);break;
                                            case 9:calendar_image.setImageResource(R.drawable.tue289);break;
                                        }break;
                                    case 4:
                                        switch(month_final){
                                            case 1:calendar_image.setImageResource(R.drawable.wed281);break;
                                            case 2:calendar_image.setImageResource(R.drawable.wed282);break;
                                            case 3:calendar_image.setImageResource(R.drawable.wed283);break;
                                            case 4:calendar_image.setImageResource(R.drawable.wed284);break;
                                            case 5:calendar_image.setImageResource(R.drawable.wed285);break;
                                            case 6:calendar_image.setImageResource(R.drawable.wed286);break;
                                            case 7:calendar_image.setImageResource(R.drawable.wed287);break;
                                            case 8:calendar_image.setImageResource(R.drawable.wed288);break;
                                            case 9:calendar_image.setImageResource(R.drawable.wed289);break;
                                        }break;
                                    case 5:
                                        switch(month_final){
                                            case 1:calendar_image.setImageResource(R.drawable.thu281);break;
                                            case 2:calendar_image.setImageResource(R.drawable.thu282);break;
                                            case 3:calendar_image.setImageResource(R.drawable.thu283);break;
                                            case 4:calendar_image.setImageResource(R.drawable.thu284);break;
                                            case 5:calendar_image.setImageResource(R.drawable.thu285);break;
                                            case 6:calendar_image.setImageResource(R.drawable.thu286);break;
                                            case 7:calendar_image.setImageResource(R.drawable.thu287);break;
                                            case 8:calendar_image.setImageResource(R.drawable.thu288);break;
                                            case 9:calendar_image.setImageResource(R.drawable.thu289);break;
                                        }break;
                                    case 6:
                                        switch(month_final){
                                            case 1:calendar_image.setImageResource(R.drawable.fir281);break;
                                            case 2:calendar_image.setImageResource(R.drawable.fir282);break;
                                            case 3:calendar_image.setImageResource(R.drawable.fir283);break;
                                            case 4:calendar_image.setImageResource(R.drawable.fir284);break;
                                            case 5:calendar_image.setImageResource(R.drawable.fir285);break;
                                            case 6:calendar_image.setImageResource(R.drawable.fir286);break;
                                            case 7:calendar_image.setImageResource(R.drawable.fir287);break;
                                            case 8:calendar_image.setImageResource(R.drawable.fir288);break;
                                            case 9:calendar_image.setImageResource(R.drawable.fir289);break;
                                        }break;
                                    case 7:
                                        switch(month_final){
                                            case 1:calendar_image.setImageResource(R.drawable.sat281);break;
                                            case 2:calendar_image.setImageResource(R.drawable.sat282);break;
                                            case 3:calendar_image.setImageResource(R.drawable.sat283);break;
                                            case 4:calendar_image.setImageResource(R.drawable.sat284);break;
                                            case 5:calendar_image.setImageResource(R.drawable.sat285);break;
                                            case 6:calendar_image.setImageResource(R.drawable.sat286);break;
                                            case 7:calendar_image.setImageResource(R.drawable.sat287);break;
                                            case 8:calendar_image.setImageResource(R.drawable.sat288);break;
                                            case 9:calendar_image.setImageResource(R.drawable.sat289);break;
                                        }break;
                                }
                            }
                        }
                        if (spinner2.getItemAtPosition(position).equals("3월")) {

                            calendar_print_123.setText("< 3월 달력 >");
                            calendar_print_123.setPaintFlags(calendar_print_123.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
                            int month_number = 3 + year_final2;
                            int month_final = month_number;
                            while (true) {
                                if (month_final < 10) {
                                    break;
                                } else {
                                    String e = Integer.toString(month_final);
                                    month_final = ((int) e.charAt(0) - 48) + ((int) e.charAt(1) - 48);
                                }
                            }
                            month_print.setText("<  1월수 (" + Integer.toString(month_final) + ")  >");
                            month_print.setPaintFlags(month_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

                            switch (month_final) {
                                case 1:
                                    month_number_print.setText(month_1);
                                    break;
                                case 2:
                                    month_number_print.setText(month_2);
                                    break;
                                case 3:
                                    month_number_print.setText(month_3);
                                    break;
                                case 4:
                                    month_number_print.setText(month_4);
                                    break;
                                case 5:
                                    month_number_print.setText(month_5);
                                    break;
                                case 6:
                                    month_number_print.setText(month_6);
                                    break;
                                case 7:
                                    month_number_print.setText(month_7);
                                    break;
                                case 8:
                                    month_number_print.setText(month_8);
                                    break;
                                case 9:
                                    month_number_print.setText(month_9);
                                    break;
                            }
                            int DECRESE_MONTH = -1;
                            int INCRESE_MONTH = +1;
                            int NOTHING_MONTH_MODE = 0;
                            int COUNT_DAY_NUMBER_IN_WEEK = 7;
                            int monthChangeType = 0;
                            int currentMonth;
                            int numberOfStartDate;
                            int numberOfEndDate;
                            int weekNumberInCurrentMonth;
                            Calendar cal;
                            int currentYear = Integer.parseInt(getCalendar);
                            currentMonth = 2;

                            cal = Calendar.getInstance();
                            cal.set(currentYear, currentMonth, 1);
                            if (monthChangeType == DECRESE_MONTH)
                                cal.add(Calendar.MONTH, DECRESE_MONTH);
                            if (monthChangeType == INCRESE_MONTH)
                                cal.add(Calendar.MONTH, INCRESE_MONTH);
                            numberOfStartDate = cal.get(Calendar.DAY_OF_WEEK);
                            numberOfEndDate = cal.getActualMaximum(Calendar.DATE);
                            cal.set(Calendar.DATE, numberOfEndDate);
                            weekNumberInCurrentMonth = cal.get(Calendar.WEEK_OF_MONTH);

                            String calendar2 = "  ";
                            int count = 0;
                            int loopCount = COUNT_DAY_NUMBER_IN_WEEK * weekNumberInCurrentMonth;
                            for (int i = 0, printDay = 1; i < loopCount; i++) {
                                if (i < numberOfStartDate || printDay > numberOfEndDate)
                                    count += 1;
                            }
                            switch(count){
                                case 1:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.sun311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.sun312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.sun313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.sun314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.sun315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.sun316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.sun317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.sun318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.sun319);break;
                                    }break;
                                case 2:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.mon311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.mon312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.mon313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.mon314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.mon315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.mon316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.mon317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.mon318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.mon319);break;
                                    }break;
                                case 3:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.tue311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.tue312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.tue313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.tue314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.tue315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.tue316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.tue317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.tue318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.tue319);break;
                                    }break;
                                case 4:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.wed311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.wed312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.wed313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.wed314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.wed315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.wed316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.wed317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.wed318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.wed319);break;
                                    }break;
                                case 5:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.thu311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.thu312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.thu313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.thu314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.thu315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.thu316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.thu317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.thu318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.thu319);break;
                                    }break;
                                case 6:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.fir311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.fir312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.fir313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.fir314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.fir315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.fir316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.fir317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.fir318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.fir319);break;
                                    }break;
                                case 7:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.sat311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.sat312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.sat313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.sat314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.sat315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.sat316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.sat317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.sat318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.sat319);break;
                                    }break;
                            }
                        }

                        if (spinner2.getItemAtPosition(position).equals("4월")) {
                            calendar_print_123.setText("< 4월 달력 >");
                            calendar_print_123.setPaintFlags(calendar_print_123.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

                            int month_number = 4 + year_final2;

                            int month_final = month_number;
                            while (true) {

                                if (month_final < 10) {
                                    break;
                                } else {
                                    String e = Integer.toString(month_final);
                                    month_final = ((int) e.charAt(0) - 48) + ((int) e.charAt(1) - 48);
                                }
                            }
                            month_print.setText("<  1월수 (" + Integer.toString(month_final) + ")  >");
                            month_print.setPaintFlags(month_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

                            switch (month_final) {
                                case 1:
                                    month_number_print.setText(month_1);
                                    break;
                                case 2:
                                    month_number_print.setText(month_2);
                                    break;
                                case 3:
                                    month_number_print.setText(month_3);
                                    break;
                                case 4:
                                    month_number_print.setText(month_4);
                                    break;
                                case 5:
                                    month_number_print.setText(month_5);
                                    break;
                                case 6:
                                    month_number_print.setText(month_6);
                                    break;
                                case 7:
                                    month_number_print.setText(month_7);
                                    break;
                                case 8:
                                    month_number_print.setText(month_8);
                                    break;
                                case 9:
                                    month_number_print.setText(month_9);
                                    break;
                            }


                            int DECRESE_MONTH = -1;
                            int INCRESE_MONTH = +1;
                            int NOTHING_MONTH_MODE = 0;
                            int COUNT_DAY_NUMBER_IN_WEEK = 7;
                            int monthChangeType = 0;
                            int currentMonth;
                            int numberOfStartDate;
                            int numberOfEndDate;
                            int weekNumberInCurrentMonth;
                            Calendar cal;
                            int currentYear = Integer.parseInt(getCalendar);
                            currentMonth = 3;

                            cal = Calendar.getInstance();
                            cal.set(currentYear, currentMonth, 1);
                            if(monthChangeType == DECRESE_MONTH) cal.add(Calendar.MONTH, DECRESE_MONTH);
                            if(monthChangeType == INCRESE_MONTH) cal.add(Calendar.MONTH, INCRESE_MONTH);
                            numberOfStartDate = cal.get(Calendar.DAY_OF_WEEK);
                            numberOfEndDate = cal.getActualMaximum(Calendar.DATE);
                            cal.set(Calendar.DATE, numberOfEndDate);
                            weekNumberInCurrentMonth = cal.get(Calendar.WEEK_OF_MONTH);



                            String calendar2="  ";
                            int count=0;
                            int loopCount = COUNT_DAY_NUMBER_IN_WEEK * weekNumberInCurrentMonth;
                            for(int i=0, printDay=1; i<loopCount;i++) {
                                if(i < numberOfStartDate || printDay > numberOfEndDate)
                                    count+=1;
                            }

                            switch(count){
                                case 1:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.sun301);break;
                                        case 2:calendar_image.setImageResource(R.drawable.sun302);break;
                                        case 3:calendar_image.setImageResource(R.drawable.sun303);break;
                                        case 4:calendar_image.setImageResource(R.drawable.sun304);break;
                                        case 5:calendar_image.setImageResource(R.drawable.sun305);break;
                                        case 6:calendar_image.setImageResource(R.drawable.sun306);break;
                                        case 7:calendar_image.setImageResource(R.drawable.sun307);break;
                                        case 8:calendar_image.setImageResource(R.drawable.sun308);break;
                                        case 9:calendar_image.setImageResource(R.drawable.sun309);break;
                                    }break;
                                case 2:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.mon301);break;
                                        case 2:calendar_image.setImageResource(R.drawable.mon302);break;
                                        case 3:calendar_image.setImageResource(R.drawable.mon303);break;
                                        case 4:calendar_image.setImageResource(R.drawable.mon304);break;
                                        case 5:calendar_image.setImageResource(R.drawable.mon305);break;
                                        case 6:calendar_image.setImageResource(R.drawable.mon306);break;
                                        case 7:calendar_image.setImageResource(R.drawable.mon307);break;
                                        case 8:calendar_image.setImageResource(R.drawable.mon308);break;
                                        case 9:calendar_image.setImageResource(R.drawable.mon309);break;
                                    }break;
                                case 3:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.tue301);break;
                                        case 2:calendar_image.setImageResource(R.drawable.tue302);break;
                                        case 3:calendar_image.setImageResource(R.drawable.tue303);break;
                                        case 4:calendar_image.setImageResource(R.drawable.tue304);break;
                                        case 5:calendar_image.setImageResource(R.drawable.tue305);break;
                                        case 6:calendar_image.setImageResource(R.drawable.tue306);break;
                                        case 7:calendar_image.setImageResource(R.drawable.tue307);break;
                                        case 8:calendar_image.setImageResource(R.drawable.tue308);break;
                                        case 9:calendar_image.setImageResource(R.drawable.tue309);break;
                                    }break;
                                case 4:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.wed301);break;
                                        case 2:calendar_image.setImageResource(R.drawable.wed302);break;
                                        case 3:calendar_image.setImageResource(R.drawable.wed303);break;
                                        case 4:calendar_image.setImageResource(R.drawable.wed304);break;
                                        case 5:calendar_image.setImageResource(R.drawable.wed305);break;
                                        case 6:calendar_image.setImageResource(R.drawable.wed306);break;
                                        case 7:calendar_image.setImageResource(R.drawable.wed307);break;
                                        case 8:calendar_image.setImageResource(R.drawable.wed308);break;
                                        case 9:calendar_image.setImageResource(R.drawable.wed309);break;
                                    }break;
                                case 5:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.thu301);break;
                                        case 2:calendar_image.setImageResource(R.drawable.thu302);break;
                                        case 3:calendar_image.setImageResource(R.drawable.thu303);break;
                                        case 4:calendar_image.setImageResource(R.drawable.thu304);break;
                                        case 5:calendar_image.setImageResource(R.drawable.thu305);break;
                                        case 6:calendar_image.setImageResource(R.drawable.thu306);break;
                                        case 7:calendar_image.setImageResource(R.drawable.thu307);break;
                                        case 8:calendar_image.setImageResource(R.drawable.thu308);break;
                                        case 9:calendar_image.setImageResource(R.drawable.thu309);break;
                                    }break;
                                case 6:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.fir301);break;
                                        case 2:calendar_image.setImageResource(R.drawable.fir302);break;
                                        case 3:calendar_image.setImageResource(R.drawable.fir303);break;
                                        case 4:calendar_image.setImageResource(R.drawable.fir304);break;
                                        case 5:calendar_image.setImageResource(R.drawable.fir305);break;
                                        case 6:calendar_image.setImageResource(R.drawable.fir306);break;
                                        case 7:calendar_image.setImageResource(R.drawable.fir307);break;
                                        case 8:calendar_image.setImageResource(R.drawable.fir308);break;
                                        case 9:calendar_image.setImageResource(R.drawable.fir309);break;
                                    }break;
                                case 7:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.sat301);break;
                                        case 2:calendar_image.setImageResource(R.drawable.sat302);break;
                                        case 3:calendar_image.setImageResource(R.drawable.sat303);break;
                                        case 4:calendar_image.setImageResource(R.drawable.sat304);break;
                                        case 5:calendar_image.setImageResource(R.drawable.sat305);break;
                                        case 6:calendar_image.setImageResource(R.drawable.sat306);break;
                                        case 7:calendar_image.setImageResource(R.drawable.sat307);break;
                                        case 8:calendar_image.setImageResource(R.drawable.sat308);break;
                                        case 9:calendar_image.setImageResource(R.drawable.sat309);break;
                                    }break;
                            }
                        }


                        if (spinner2.getItemAtPosition(position).equals("5월")) {
                            calendar_print_123.setText("< 5월 달력 >");
                            calendar_print_123.setPaintFlags(calendar_print_123.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

                            int month_number = 5 + year_final2;

                            int month_final = month_number;
                            while (true) {

                                if (month_final < 10) {
                                    break;
                                } else {
                                    String e = Integer.toString(month_final);
                                    month_final = ((int) e.charAt(0) - 48) + ((int) e.charAt(1) - 48);
                                }
                            }
                            month_print.setText("<  1월수 (" + Integer.toString(month_final) + ")  >");
                            month_print.setPaintFlags(month_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

                            switch (month_final) {
                                case 1:
                                    month_number_print.setText(month_1);
                                    break;
                                case 2:
                                    month_number_print.setText(month_2);
                                    break;
                                case 3:
                                    month_number_print.setText(month_3);
                                    break;
                                case 4:
                                    month_number_print.setText(month_4);
                                    break;
                                case 5:
                                    month_number_print.setText(month_5);
                                    break;
                                case 6:
                                    month_number_print.setText(month_6);
                                    break;
                                case 7:
                                    month_number_print.setText(month_7);
                                    break;
                                case 8:
                                    month_number_print.setText(month_8);
                                    break;
                                case 9:
                                    month_number_print.setText(month_9);
                                    break;
                            }


                            int DECRESE_MONTH = -1;
                            int INCRESE_MONTH = +1;
                            int NOTHING_MONTH_MODE = 0;
                            int COUNT_DAY_NUMBER_IN_WEEK = 7;
                            int monthChangeType = 0;
                            int currentMonth;
                            int numberOfStartDate;
                            int numberOfEndDate;
                            int weekNumberInCurrentMonth;
                            Calendar cal;
                            int currentYear = Integer.parseInt(getCalendar);
                            currentMonth = 4;

                            cal = Calendar.getInstance();
                            cal.set(currentYear, currentMonth, 1);
                            if(monthChangeType == DECRESE_MONTH) cal.add(Calendar.MONTH, DECRESE_MONTH);
                            if(monthChangeType == INCRESE_MONTH) cal.add(Calendar.MONTH, INCRESE_MONTH);
                            numberOfStartDate = cal.get(Calendar.DAY_OF_WEEK);
                            numberOfEndDate = cal.getActualMaximum(Calendar.DATE);
                            cal.set(Calendar.DATE, numberOfEndDate);
                            weekNumberInCurrentMonth = cal.get(Calendar.WEEK_OF_MONTH);

                            String calendar2="  ";
                            int count=0;
                            int loopCount = COUNT_DAY_NUMBER_IN_WEEK * weekNumberInCurrentMonth;
                            for(int i=0, printDay=1; i<loopCount;i++) {
                                if(i < numberOfStartDate || printDay > numberOfEndDate)
                                    count+=1;
                            }

                            switch(count){
                                case 1:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.sun311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.sun312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.sun313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.sun314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.sun315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.sun316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.sun317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.sun318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.sun319);break;
                                    }break;
                                case 2:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.mon311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.mon312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.mon313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.mon314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.mon315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.mon316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.mon317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.mon318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.mon319);break;
                                    }break;
                                case 3:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.tue311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.tue312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.tue313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.tue314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.tue315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.tue316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.tue317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.tue318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.tue319);break;
                                    }break;
                                case 4:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.wed311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.wed312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.wed313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.wed314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.wed315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.wed316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.wed317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.wed318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.wed319);break;
                                    }break;
                                case 5:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.thu311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.thu312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.thu313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.thu314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.thu315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.thu316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.thu317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.thu318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.thu319);break;
                                    }break;
                                case 6:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.fir311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.fir312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.fir313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.fir314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.fir315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.fir316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.fir317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.fir318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.fir319);break;
                                    }break;
                                case 7:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.sat311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.sat312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.sat313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.sat314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.sat315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.sat316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.sat317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.sat318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.sat319);break;
                                    }break;
                            }
                        }

                        if (spinner2.getItemAtPosition(position).equals("6월")) {
                            calendar_print_123.setText("< 6월 달력 >");
                            calendar_print_123.setPaintFlags(calendar_print_123.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

                            int month_number = 6 + year_final2;

                            int month_final = month_number;
                            while (true) {

                                if (month_final < 10) {
                                    break;
                                } else {
                                    String e = Integer.toString(month_final);
                                    month_final = ((int) e.charAt(0) - 48) + ((int) e.charAt(1) - 48);
                                }
                            }
                            month_print.setText("<  1월수 (" + Integer.toString(month_final) + ")  >");
                            month_print.setPaintFlags(month_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

                            switch (month_final) {
                                case 1:
                                    month_number_print.setText(month_1);
                                    break;
                                case 2:
                                    month_number_print.setText(month_2);
                                    break;
                                case 3:
                                    month_number_print.setText(month_3);
                                    break;
                                case 4:
                                    month_number_print.setText(month_4);
                                    break;
                                case 5:
                                    month_number_print.setText(month_5);
                                    break;
                                case 6:
                                    month_number_print.setText(month_6);
                                    break;
                                case 7:
                                    month_number_print.setText(month_7);
                                    break;
                                case 8:
                                    month_number_print.setText(month_8);
                                    break;
                                case 9:
                                    month_number_print.setText(month_9);
                                    break;
                            }


                            int DECRESE_MONTH = -1;
                            int INCRESE_MONTH = +1;
                            int NOTHING_MONTH_MODE = 0;
                            int COUNT_DAY_NUMBER_IN_WEEK = 7;
                            int monthChangeType = 0;
                            int currentMonth;
                            int numberOfStartDate;
                            int numberOfEndDate;
                            int weekNumberInCurrentMonth;
                            Calendar cal;
                            int currentYear = Integer.parseInt(getCalendar);
                            currentMonth = 5;

                            cal = Calendar.getInstance();
                            cal.set(currentYear, currentMonth, 1);
                            if(monthChangeType == DECRESE_MONTH) cal.add(Calendar.MONTH, DECRESE_MONTH);
                            if(monthChangeType == INCRESE_MONTH) cal.add(Calendar.MONTH, INCRESE_MONTH);
                            numberOfStartDate = cal.get(Calendar.DAY_OF_WEEK);
                            numberOfEndDate = cal.getActualMaximum(Calendar.DATE);
                            cal.set(Calendar.DATE, numberOfEndDate);
                            weekNumberInCurrentMonth = cal.get(Calendar.WEEK_OF_MONTH);



                            String calendar2="  ";
                            int count=0;
                            int loopCount = COUNT_DAY_NUMBER_IN_WEEK * weekNumberInCurrentMonth;
                            for(int i=0, printDay=1; i<loopCount;i++) {
                                if(i < numberOfStartDate || printDay > numberOfEndDate)
                                    count+=1;
                            }

                            switch(count){
                                case 1:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.sun301);break;
                                        case 2:calendar_image.setImageResource(R.drawable.sun302);break;
                                        case 3:calendar_image.setImageResource(R.drawable.sun303);break;
                                        case 4:calendar_image.setImageResource(R.drawable.sun304);break;
                                        case 5:calendar_image.setImageResource(R.drawable.sun305);break;
                                        case 6:calendar_image.setImageResource(R.drawable.sun306);break;
                                        case 7:calendar_image.setImageResource(R.drawable.sun307);break;
                                        case 8:calendar_image.setImageResource(R.drawable.sun308);break;
                                        case 9:calendar_image.setImageResource(R.drawable.sun309);break;
                                    }break;
                                case 2:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.mon301);break;
                                        case 2:calendar_image.setImageResource(R.drawable.mon302);break;
                                        case 3:calendar_image.setImageResource(R.drawable.mon303);break;
                                        case 4:calendar_image.setImageResource(R.drawable.mon304);break;
                                        case 5:calendar_image.setImageResource(R.drawable.mon305);break;
                                        case 6:calendar_image.setImageResource(R.drawable.mon306);break;
                                        case 7:calendar_image.setImageResource(R.drawable.mon307);break;
                                        case 8:calendar_image.setImageResource(R.drawable.mon308);break;
                                        case 9:calendar_image.setImageResource(R.drawable.mon309);break;
                                    }break;
                                case 3:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.tue301);break;
                                        case 2:calendar_image.setImageResource(R.drawable.tue302);break;
                                        case 3:calendar_image.setImageResource(R.drawable.tue303);break;
                                        case 4:calendar_image.setImageResource(R.drawable.tue304);break;
                                        case 5:calendar_image.setImageResource(R.drawable.tue305);break;
                                        case 6:calendar_image.setImageResource(R.drawable.tue306);break;
                                        case 7:calendar_image.setImageResource(R.drawable.tue307);break;
                                        case 8:calendar_image.setImageResource(R.drawable.tue308);break;
                                        case 9:calendar_image.setImageResource(R.drawable.tue309);break;
                                    }break;
                                case 4:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.wed301);break;
                                        case 2:calendar_image.setImageResource(R.drawable.wed302);break;
                                        case 3:calendar_image.setImageResource(R.drawable.wed303);break;
                                        case 4:calendar_image.setImageResource(R.drawable.wed304);break;
                                        case 5:calendar_image.setImageResource(R.drawable.wed305);break;
                                        case 6:calendar_image.setImageResource(R.drawable.wed306);break;
                                        case 7:calendar_image.setImageResource(R.drawable.wed307);break;
                                        case 8:calendar_image.setImageResource(R.drawable.wed308);break;
                                        case 9:calendar_image.setImageResource(R.drawable.wed309);break;
                                    }break;
                                case 5:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.thu301);break;
                                        case 2:calendar_image.setImageResource(R.drawable.thu302);break;
                                        case 3:calendar_image.setImageResource(R.drawable.thu303);break;
                                        case 4:calendar_image.setImageResource(R.drawable.thu304);break;
                                        case 5:calendar_image.setImageResource(R.drawable.thu305);break;
                                        case 6:calendar_image.setImageResource(R.drawable.thu306);break;
                                        case 7:calendar_image.setImageResource(R.drawable.thu307);break;
                                        case 8:calendar_image.setImageResource(R.drawable.thu308);break;
                                        case 9:calendar_image.setImageResource(R.drawable.thu309);break;
                                    }break;
                                case 6:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.fir301);break;
                                        case 2:calendar_image.setImageResource(R.drawable.fir302);break;
                                        case 3:calendar_image.setImageResource(R.drawable.fir303);break;
                                        case 4:calendar_image.setImageResource(R.drawable.fir304);break;
                                        case 5:calendar_image.setImageResource(R.drawable.fir305);break;
                                        case 6:calendar_image.setImageResource(R.drawable.fir306);break;
                                        case 7:calendar_image.setImageResource(R.drawable.fir307);break;
                                        case 8:calendar_image.setImageResource(R.drawable.fir308);break;
                                        case 9:calendar_image.setImageResource(R.drawable.fir309);break;
                                    }break;
                                case 7:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.sat301);break;
                                        case 2:calendar_image.setImageResource(R.drawable.sat302);break;
                                        case 3:calendar_image.setImageResource(R.drawable.sat303);break;
                                        case 4:calendar_image.setImageResource(R.drawable.sat304);break;
                                        case 5:calendar_image.setImageResource(R.drawable.sat305);break;
                                        case 6:calendar_image.setImageResource(R.drawable.sat306);break;
                                        case 7:calendar_image.setImageResource(R.drawable.sat307);break;
                                        case 8:calendar_image.setImageResource(R.drawable.sat308);break;
                                        case 9:calendar_image.setImageResource(R.drawable.sat309);break;
                                    }break;
                            }
                        }

                        if (spinner2.getItemAtPosition(position).equals("7월")) {
                            calendar_print_123.setText("< 7월 달력 >");
                            calendar_print_123.setPaintFlags(calendar_print_123.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

                            int month_number = 7 + year_final2;

                            int month_final = month_number;
                            while (true) {

                                if (month_final < 10) {
                                    break;
                                } else {
                                    String e = Integer.toString(month_final);
                                    month_final = ((int) e.charAt(0) - 48) + ((int) e.charAt(1) - 48);
                                }
                            }
                            month_print.setText("<  1월수 (" + Integer.toString(month_final) + ")  >");
                            month_print.setPaintFlags(month_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

                            switch (month_final) {
                                case 1:
                                    month_number_print.setText(month_1);
                                    break;
                                case 2:
                                    month_number_print.setText(month_2);
                                    break;
                                case 3:
                                    month_number_print.setText(month_3);
                                    break;
                                case 4:
                                    month_number_print.setText(month_4);
                                    break;
                                case 5:
                                    month_number_print.setText(month_5);
                                    break;
                                case 6:
                                    month_number_print.setText(month_6);
                                    break;
                                case 7:
                                    month_number_print.setText(month_7);
                                    break;
                                case 8:
                                    month_number_print.setText(month_8);
                                    break;
                                case 9:
                                    month_number_print.setText(month_9);
                                    break;
                            }


                            int DECRESE_MONTH = -1;
                            int INCRESE_MONTH = +1;
                            int NOTHING_MONTH_MODE = 0;
                            int COUNT_DAY_NUMBER_IN_WEEK = 7;
                            int monthChangeType = 0;
                            int currentMonth;
                            int numberOfStartDate;
                            int numberOfEndDate;
                            int weekNumberInCurrentMonth;
                            Calendar cal;
                            int currentYear = Integer.parseInt(getCalendar);
                            currentMonth = 6;

                            cal = Calendar.getInstance();
                            cal.set(currentYear, currentMonth, 1);
                            if(monthChangeType == DECRESE_MONTH) cal.add(Calendar.MONTH, DECRESE_MONTH);
                            if(monthChangeType == INCRESE_MONTH) cal.add(Calendar.MONTH, INCRESE_MONTH);
                            numberOfStartDate = cal.get(Calendar.DAY_OF_WEEK);
                            numberOfEndDate = cal.getActualMaximum(Calendar.DATE);
                            cal.set(Calendar.DATE, numberOfEndDate);
                            weekNumberInCurrentMonth = cal.get(Calendar.WEEK_OF_MONTH);



                            String calendar2="  ";
                            int count=0;
                            int loopCount = COUNT_DAY_NUMBER_IN_WEEK * weekNumberInCurrentMonth;
                            for(int i=0, printDay=1; i<loopCount;i++) {
                                if(i < numberOfStartDate || printDay > numberOfEndDate)
                                    count+=1;
                            }

                            switch(count){
                                case 1:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.sun311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.sun312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.sun313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.sun314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.sun315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.sun316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.sun317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.sun318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.sun319);break;
                                    }break;
                                case 2:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.mon311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.mon312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.mon313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.mon314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.mon315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.mon316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.mon317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.mon318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.mon319);break;
                                    }break;
                                case 3:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.tue311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.tue312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.tue313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.tue314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.tue315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.tue316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.tue317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.tue318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.tue319);break;
                                    }break;
                                case 4:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.wed311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.wed312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.wed313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.wed314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.wed315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.wed316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.wed317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.wed318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.wed319);break;
                                    }break;
                                case 5:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.thu311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.thu312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.thu313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.thu314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.thu315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.thu316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.thu317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.thu318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.thu319);break;
                                    }break;
                                case 6:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.fir311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.fir312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.fir313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.fir314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.fir315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.fir316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.fir317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.fir318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.fir319);break;
                                    }break;
                                case 7:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.sat311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.sat312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.sat313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.sat314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.sat315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.sat316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.sat317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.sat318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.sat319);break;
                                    }break;
                            }
                        }

                        if (spinner2.getItemAtPosition(position).equals("8월")) {

                            calendar_print_123.setText("< 8월 달력 >");
                            calendar_print_123.setPaintFlags(calendar_print_123.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

                            int month_number = 8 + year_final2;

                            int month_final = month_number;
                            while (true) {

                                if (month_final < 10) {
                                    break;
                                } else {
                                    String e = Integer.toString(month_final);
                                    month_final = ((int) e.charAt(0) - 48) + ((int) e.charAt(1) - 48);
                                }
                            }
                            month_print.setText("<  1월수 (" + Integer.toString(month_final) + ")  >");
                            month_print.setPaintFlags(month_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

                            switch (month_final) {
                                case 1:
                                    month_number_print.setText(month_1);
                                    break;
                                case 2:
                                    month_number_print.setText(month_2);
                                    break;
                                case 3:
                                    month_number_print.setText(month_3);
                                    break;
                                case 4:
                                    month_number_print.setText(month_4);
                                    break;
                                case 5:
                                    month_number_print.setText(month_5);
                                    break;
                                case 6:
                                    month_number_print.setText(month_6);
                                    break;
                                case 7:
                                    month_number_print.setText(month_7);
                                    break;
                                case 8:
                                    month_number_print.setText(month_8);
                                    break;
                                case 9:
                                    month_number_print.setText(month_9);
                                    break;
                            }


                            int DECRESE_MONTH = -1;
                            int INCRESE_MONTH = +1;
                            int NOTHING_MONTH_MODE = 0;
                            int COUNT_DAY_NUMBER_IN_WEEK = 7;
                            int monthChangeType = 0;
                            int currentMonth;
                            int numberOfStartDate;
                            int numberOfEndDate;
                            int weekNumberInCurrentMonth;
                            Calendar cal;
                            int currentYear = Integer.parseInt(getCalendar);
                            currentMonth = 7;

                            cal = Calendar.getInstance();
                            cal.set(currentYear, currentMonth, 1);
                            if(monthChangeType == DECRESE_MONTH) cal.add(Calendar.MONTH, DECRESE_MONTH);
                            if(monthChangeType == INCRESE_MONTH) cal.add(Calendar.MONTH, INCRESE_MONTH);
                            numberOfStartDate = cal.get(Calendar.DAY_OF_WEEK);
                            numberOfEndDate = cal.getActualMaximum(Calendar.DATE);
                            cal.set(Calendar.DATE, numberOfEndDate);
                            weekNumberInCurrentMonth = cal.get(Calendar.WEEK_OF_MONTH);



                            String calendar2="  ";
                            int count=0;
                            int loopCount = COUNT_DAY_NUMBER_IN_WEEK * weekNumberInCurrentMonth;
                            for(int i=0, printDay=1; i<loopCount;i++) {
                                if(i < numberOfStartDate || printDay > numberOfEndDate)
                                    count+=1;
                            }

                            switch(count){
                                case 1:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.sun311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.sun312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.sun313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.sun314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.sun315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.sun316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.sun317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.sun318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.sun319);break;
                                    }break;
                                case 2:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.mon311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.mon312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.mon313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.mon314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.mon315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.mon316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.mon317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.mon318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.mon319);break;
                                    }break;
                                case 3:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.tue311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.tue312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.tue313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.tue314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.tue315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.tue316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.tue317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.tue318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.tue319);break;
                                    }break;
                                case 4:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.wed311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.wed312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.wed313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.wed314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.wed315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.wed316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.wed317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.wed318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.wed319);break;
                                    }break;
                                case 5:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.thu311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.thu312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.thu313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.thu314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.thu315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.thu316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.thu317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.thu318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.thu319);break;
                                    }break;
                                case 6:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.fir311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.fir312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.fir313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.fir314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.fir315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.fir316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.fir317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.fir318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.fir319);break;
                                    }break;
                                case 7:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.sat311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.sat312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.sat313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.sat314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.sat315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.sat316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.sat317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.sat318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.sat319);break;
                                    }break;
                            }
                        }

                        if (spinner2.getItemAtPosition(position).equals("9월")) {

                            calendar_print_123.setText("< 9월 달력 >");
                            calendar_print_123.setPaintFlags(calendar_print_123.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

                            int month_number = 9 + year_final2;

                            int month_final = month_number;
                            while (true) {

                                if (month_final < 10) {
                                    break;
                                } else {
                                    String e = Integer.toString(month_final);
                                    month_final = ((int) e.charAt(0) - 48) + ((int) e.charAt(1) - 48);
                                }
                            }
                            month_print.setText("<  1월수 (" + Integer.toString(month_final) + ")  >");
                            month_print.setPaintFlags(month_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

                            switch (month_final) {
                                case 1:
                                    month_number_print.setText(month_1);
                                    break;
                                case 2:
                                    month_number_print.setText(month_2);
                                    break;
                                case 3:
                                    month_number_print.setText(month_3);
                                    break;
                                case 4:
                                    month_number_print.setText(month_4);
                                    break;
                                case 5:
                                    month_number_print.setText(month_5);
                                    break;
                                case 6:
                                    month_number_print.setText(month_6);
                                    break;
                                case 7:
                                    month_number_print.setText(month_7);
                                    break;
                                case 8:
                                    month_number_print.setText(month_8);
                                    break;
                                case 9:
                                    month_number_print.setText(month_9);
                                    break;
                            }


                            int DECRESE_MONTH = -1;
                            int INCRESE_MONTH = +1;
                            int NOTHING_MONTH_MODE = 0;
                            int COUNT_DAY_NUMBER_IN_WEEK = 7;
                            int monthChangeType = 0;
                            int currentMonth;
                            int numberOfStartDate;
                            int numberOfEndDate;
                            int weekNumberInCurrentMonth;
                            Calendar cal;
                            int currentYear = Integer.parseInt(getCalendar);
                            currentMonth = 8;

                            cal = Calendar.getInstance();
                            cal.set(currentYear, currentMonth, 1);
                            if(monthChangeType == DECRESE_MONTH) cal.add(Calendar.MONTH, DECRESE_MONTH);
                            if(monthChangeType == INCRESE_MONTH) cal.add(Calendar.MONTH, INCRESE_MONTH);
                            numberOfStartDate = cal.get(Calendar.DAY_OF_WEEK);
                            numberOfEndDate = cal.getActualMaximum(Calendar.DATE);
                            cal.set(Calendar.DATE, numberOfEndDate);
                            weekNumberInCurrentMonth = cal.get(Calendar.WEEK_OF_MONTH);



                            String calendar2="  ";
                            int count=0;
                            int loopCount = COUNT_DAY_NUMBER_IN_WEEK * weekNumberInCurrentMonth;
                            for(int i=0, printDay=1; i<loopCount;i++) {
                                if(i < numberOfStartDate || printDay > numberOfEndDate)
                                    count+=1;
                            }

                            switch(count){
                                case 1:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.sun301);break;
                                        case 2:calendar_image.setImageResource(R.drawable.sun302);break;
                                        case 3:calendar_image.setImageResource(R.drawable.sun303);break;
                                        case 4:calendar_image.setImageResource(R.drawable.sun304);break;
                                        case 5:calendar_image.setImageResource(R.drawable.sun305);break;
                                        case 6:calendar_image.setImageResource(R.drawable.sun306);break;
                                        case 7:calendar_image.setImageResource(R.drawable.sun307);break;
                                        case 8:calendar_image.setImageResource(R.drawable.sun308);break;
                                        case 9:calendar_image.setImageResource(R.drawable.sun309);break;
                                    }break;
                                case 2:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.mon301);break;
                                        case 2:calendar_image.setImageResource(R.drawable.mon302);break;
                                        case 3:calendar_image.setImageResource(R.drawable.mon303);break;
                                        case 4:calendar_image.setImageResource(R.drawable.mon304);break;
                                        case 5:calendar_image.setImageResource(R.drawable.mon305);break;
                                        case 6:calendar_image.setImageResource(R.drawable.mon306);break;
                                        case 7:calendar_image.setImageResource(R.drawable.mon307);break;
                                        case 8:calendar_image.setImageResource(R.drawable.mon308);break;
                                        case 9:calendar_image.setImageResource(R.drawable.mon309);break;
                                    }break;
                                case 3:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.tue301);break;
                                        case 2:calendar_image.setImageResource(R.drawable.tue302);break;
                                        case 3:calendar_image.setImageResource(R.drawable.tue303);break;
                                        case 4:calendar_image.setImageResource(R.drawable.tue304);break;
                                        case 5:calendar_image.setImageResource(R.drawable.tue305);break;
                                        case 6:calendar_image.setImageResource(R.drawable.tue306);break;
                                        case 7:calendar_image.setImageResource(R.drawable.tue307);break;
                                        case 8:calendar_image.setImageResource(R.drawable.tue308);break;
                                        case 9:calendar_image.setImageResource(R.drawable.tue309);break;
                                    }break;
                                case 4:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.wed301);break;
                                        case 2:calendar_image.setImageResource(R.drawable.wed302);break;
                                        case 3:calendar_image.setImageResource(R.drawable.wed303);break;
                                        case 4:calendar_image.setImageResource(R.drawable.wed304);break;
                                        case 5:calendar_image.setImageResource(R.drawable.wed305);break;
                                        case 6:calendar_image.setImageResource(R.drawable.wed306);break;
                                        case 7:calendar_image.setImageResource(R.drawable.wed307);break;
                                        case 8:calendar_image.setImageResource(R.drawable.wed308);break;
                                        case 9:calendar_image.setImageResource(R.drawable.wed309);break;
                                    }break;
                                case 5:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.thu301);break;
                                        case 2:calendar_image.setImageResource(R.drawable.thu302);break;
                                        case 3:calendar_image.setImageResource(R.drawable.thu303);break;
                                        case 4:calendar_image.setImageResource(R.drawable.thu304);break;
                                        case 5:calendar_image.setImageResource(R.drawable.thu305);break;
                                        case 6:calendar_image.setImageResource(R.drawable.thu306);break;
                                        case 7:calendar_image.setImageResource(R.drawable.thu307);break;
                                        case 8:calendar_image.setImageResource(R.drawable.thu308);break;
                                        case 9:calendar_image.setImageResource(R.drawable.thu309);break;
                                    }break;
                                case 6:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.fir301);break;
                                        case 2:calendar_image.setImageResource(R.drawable.fir302);break;
                                        case 3:calendar_image.setImageResource(R.drawable.fir303);break;
                                        case 4:calendar_image.setImageResource(R.drawable.fir304);break;
                                        case 5:calendar_image.setImageResource(R.drawable.fir305);break;
                                        case 6:calendar_image.setImageResource(R.drawable.fir306);break;
                                        case 7:calendar_image.setImageResource(R.drawable.fir307);break;
                                        case 8:calendar_image.setImageResource(R.drawable.fir308);break;
                                        case 9:calendar_image.setImageResource(R.drawable.fir309);break;
                                    }break;
                                case 7:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.sat301);break;
                                        case 2:calendar_image.setImageResource(R.drawable.sat302);break;
                                        case 3:calendar_image.setImageResource(R.drawable.sat303);break;
                                        case 4:calendar_image.setImageResource(R.drawable.sat304);break;
                                        case 5:calendar_image.setImageResource(R.drawable.sat305);break;
                                        case 6:calendar_image.setImageResource(R.drawable.sat306);break;
                                        case 7:calendar_image.setImageResource(R.drawable.sat307);break;
                                        case 8:calendar_image.setImageResource(R.drawable.sat308);break;
                                        case 9:calendar_image.setImageResource(R.drawable.sat309);break;
                                    }break;
                            }
                        }

                        if (spinner2.getItemAtPosition(position).equals("10월")) {

                            calendar_print_123.setText("< 10월 달력 >");
                            calendar_print_123.setPaintFlags(calendar_print_123.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

                            int month_number = 10 + year_final2;

                            int month_final = month_number;
                            while (true) {

                                if (month_final < 10) {
                                    break;
                                } else {
                                    String e = Integer.toString(month_final);
                                    month_final = ((int) e.charAt(0) - 48) + ((int) e.charAt(1) - 48);
                                }
                            }
                            month_print.setText("<  1월수 (" + Integer.toString(month_final) + ")  >");
                            month_print.setPaintFlags(month_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

                            switch (month_final) {
                                case 1:
                                    month_number_print.setText(month_1);
                                    break;
                                case 2:
                                    month_number_print.setText(month_2);
                                    break;
                                case 3:
                                    month_number_print.setText(month_3);
                                    break;
                                case 4:
                                    month_number_print.setText(month_4);
                                    break;
                                case 5:
                                    month_number_print.setText(month_5);
                                    break;
                                case 6:
                                    month_number_print.setText(month_6);
                                    break;
                                case 7:
                                    month_number_print.setText(month_7);
                                    break;
                                case 8:
                                    month_number_print.setText(month_8);
                                    break;
                                case 9:
                                    month_number_print.setText(month_9);
                                    break;
                            }


                            int DECRESE_MONTH = -1;
                            int INCRESE_MONTH = +1;
                            int NOTHING_MONTH_MODE = 0;
                            int COUNT_DAY_NUMBER_IN_WEEK = 7;
                            int monthChangeType = 0;
                            int currentMonth;
                            int numberOfStartDate;
                            int numberOfEndDate;
                            int weekNumberInCurrentMonth;
                            Calendar cal;
                            int currentYear = Integer.parseInt(getCalendar);
                            currentMonth = 9;

                            cal = Calendar.getInstance();
                            cal.set(currentYear, currentMonth, 1);
                            if(monthChangeType == DECRESE_MONTH) cal.add(Calendar.MONTH, DECRESE_MONTH);
                            if(monthChangeType == INCRESE_MONTH) cal.add(Calendar.MONTH, INCRESE_MONTH);
                            numberOfStartDate = cal.get(Calendar.DAY_OF_WEEK);
                            numberOfEndDate = cal.getActualMaximum(Calendar.DATE);
                            cal.set(Calendar.DATE, numberOfEndDate);
                            weekNumberInCurrentMonth = cal.get(Calendar.WEEK_OF_MONTH);



                            String calendar2="  ";
                            int count=0;
                            int loopCount = COUNT_DAY_NUMBER_IN_WEEK * weekNumberInCurrentMonth;
                            for(int i=0, printDay=1; i<loopCount;i++) {
                                if(i < numberOfStartDate || printDay > numberOfEndDate)
                                    count+=1;
                            }

                            switch(count){
                                case 1:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.sun311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.sun312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.sun313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.sun314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.sun315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.sun316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.sun317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.sun318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.sun319);break;
                                    }break;
                                case 2:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.mon311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.mon312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.mon313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.mon314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.mon315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.mon316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.mon317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.mon318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.mon319);break;
                                    }break;
                                case 3:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.tue311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.tue312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.tue313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.tue314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.tue315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.tue316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.tue317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.tue318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.tue319);break;
                                    }break;
                                case 4:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.wed311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.wed312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.wed313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.wed314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.wed315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.wed316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.wed317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.wed318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.wed319);break;
                                    }break;
                                case 5:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.thu311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.thu312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.thu313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.thu314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.thu315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.thu316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.thu317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.thu318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.thu319);break;
                                    }break;
                                case 6:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.fir311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.fir312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.fir313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.fir314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.fir315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.fir316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.fir317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.fir318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.fir319);break;
                                    }break;
                                case 7:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.sat311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.sat312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.sat313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.sat314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.sat315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.sat316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.sat317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.sat318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.sat319);break;
                                    }break;
                            }
                        }

                        if (spinner2.getItemAtPosition(position).equals("11월")) {

                            calendar_print_123.setText("< 11월 달력 >");
                            calendar_print_123.setPaintFlags(calendar_print_123.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

                            int month_number = 11 + year_final2;

                            int month_final = month_number;
                            while (true) {

                                if (month_final < 10) {
                                    break;
                                } else {
                                    String e = Integer.toString(month_final);
                                    month_final = ((int) e.charAt(0) - 48) + ((int) e.charAt(1) - 48);
                                }
                            }
                            month_print.setText("<  1월수 (" + Integer.toString(month_final) + ")  >");
                            month_print.setPaintFlags(month_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

                            switch (month_final) {
                                case 1:
                                    month_number_print.setText(month_1);
                                    break;
                                case 2:
                                    month_number_print.setText(month_2);
                                    break;
                                case 3:
                                    month_number_print.setText(month_3);
                                    break;
                                case 4:
                                    month_number_print.setText(month_4);
                                    break;
                                case 5:
                                    month_number_print.setText(month_5);
                                    break;
                                case 6:
                                    month_number_print.setText(month_6);
                                    break;
                                case 7:
                                    month_number_print.setText(month_7);
                                    break;
                                case 8:
                                    month_number_print.setText(month_8);
                                    break;
                                case 9:
                                    month_number_print.setText(month_9);
                                    break;
                            }


                            int DECRESE_MONTH = -1;
                            int INCRESE_MONTH = +1;
                            int NOTHING_MONTH_MODE = 0;
                            int COUNT_DAY_NUMBER_IN_WEEK = 7;
                            int monthChangeType = 0;
                            int currentMonth;
                            int numberOfStartDate;
                            int numberOfEndDate;
                            int weekNumberInCurrentMonth;
                            Calendar cal;
                            int currentYear = Integer.parseInt(getCalendar);
                            currentMonth = 10;

                            cal = Calendar.getInstance();
                            cal.set(currentYear, currentMonth, 1);
                            if(monthChangeType == DECRESE_MONTH) cal.add(Calendar.MONTH, DECRESE_MONTH);
                            if(monthChangeType == INCRESE_MONTH) cal.add(Calendar.MONTH, INCRESE_MONTH);
                            numberOfStartDate = cal.get(Calendar.DAY_OF_WEEK);
                            numberOfEndDate = cal.getActualMaximum(Calendar.DATE);
                            cal.set(Calendar.DATE, numberOfEndDate);
                            weekNumberInCurrentMonth = cal.get(Calendar.WEEK_OF_MONTH);



                            String calendar2="  ";
                            int count=0;
                            int loopCount = COUNT_DAY_NUMBER_IN_WEEK * weekNumberInCurrentMonth;
                            for(int i=0, printDay=1; i<loopCount;i++) {
                                if(i < numberOfStartDate || printDay > numberOfEndDate)
                                    count+=1;
                            }

                            switch(count){
                                case 1:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.sun301);break;
                                        case 2:calendar_image.setImageResource(R.drawable.sun302);break;
                                        case 3:calendar_image.setImageResource(R.drawable.sun303);break;
                                        case 4:calendar_image.setImageResource(R.drawable.sun304);break;
                                        case 5:calendar_image.setImageResource(R.drawable.sun305);break;
                                        case 6:calendar_image.setImageResource(R.drawable.sun306);break;
                                        case 7:calendar_image.setImageResource(R.drawable.sun307);break;
                                        case 8:calendar_image.setImageResource(R.drawable.sun308);break;
                                        case 9:calendar_image.setImageResource(R.drawable.sun309);break;
                                    }break;
                                case 2:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.mon301);break;
                                        case 2:calendar_image.setImageResource(R.drawable.mon302);break;
                                        case 3:calendar_image.setImageResource(R.drawable.mon303);break;
                                        case 4:calendar_image.setImageResource(R.drawable.mon304);break;
                                        case 5:calendar_image.setImageResource(R.drawable.mon305);break;
                                        case 6:calendar_image.setImageResource(R.drawable.mon306);break;
                                        case 7:calendar_image.setImageResource(R.drawable.mon307);break;
                                        case 8:calendar_image.setImageResource(R.drawable.mon308);break;
                                        case 9:calendar_image.setImageResource(R.drawable.mon309);break;
                                    }break;
                                case 3:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.tue301);break;
                                        case 2:calendar_image.setImageResource(R.drawable.tue302);break;
                                        case 3:calendar_image.setImageResource(R.drawable.tue303);break;
                                        case 4:calendar_image.setImageResource(R.drawable.tue304);break;
                                        case 5:calendar_image.setImageResource(R.drawable.tue305);break;
                                        case 6:calendar_image.setImageResource(R.drawable.tue306);break;
                                        case 7:calendar_image.setImageResource(R.drawable.tue307);break;
                                        case 8:calendar_image.setImageResource(R.drawable.tue308);break;
                                        case 9:calendar_image.setImageResource(R.drawable.tue309);break;
                                    }break;
                                case 4:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.wed301);break;
                                        case 2:calendar_image.setImageResource(R.drawable.wed302);break;
                                        case 3:calendar_image.setImageResource(R.drawable.wed303);break;
                                        case 4:calendar_image.setImageResource(R.drawable.wed304);break;
                                        case 5:calendar_image.setImageResource(R.drawable.wed305);break;
                                        case 6:calendar_image.setImageResource(R.drawable.wed306);break;
                                        case 7:calendar_image.setImageResource(R.drawable.wed307);break;
                                        case 8:calendar_image.setImageResource(R.drawable.wed308);break;
                                        case 9:calendar_image.setImageResource(R.drawable.wed309);break;
                                    }break;
                                case 5:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.thu301);break;
                                        case 2:calendar_image.setImageResource(R.drawable.thu302);break;
                                        case 3:calendar_image.setImageResource(R.drawable.thu303);break;
                                        case 4:calendar_image.setImageResource(R.drawable.thu304);break;
                                        case 5:calendar_image.setImageResource(R.drawable.thu305);break;
                                        case 6:calendar_image.setImageResource(R.drawable.thu306);break;
                                        case 7:calendar_image.setImageResource(R.drawable.thu307);break;
                                        case 8:calendar_image.setImageResource(R.drawable.thu308);break;
                                        case 9:calendar_image.setImageResource(R.drawable.thu309);break;
                                    }break;
                                case 6:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.fir301);break;
                                        case 2:calendar_image.setImageResource(R.drawable.fir302);break;
                                        case 3:calendar_image.setImageResource(R.drawable.fir303);break;
                                        case 4:calendar_image.setImageResource(R.drawable.fir304);break;
                                        case 5:calendar_image.setImageResource(R.drawable.fir305);break;
                                        case 6:calendar_image.setImageResource(R.drawable.fir306);break;
                                        case 7:calendar_image.setImageResource(R.drawable.fir307);break;
                                        case 8:calendar_image.setImageResource(R.drawable.fir308);break;
                                        case 9:calendar_image.setImageResource(R.drawable.fir309);break;
                                    }break;
                                case 7:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.sat301);break;
                                        case 2:calendar_image.setImageResource(R.drawable.sat302);break;
                                        case 3:calendar_image.setImageResource(R.drawable.sat303);break;
                                        case 4:calendar_image.setImageResource(R.drawable.sat304);break;
                                        case 5:calendar_image.setImageResource(R.drawable.sat305);break;
                                        case 6:calendar_image.setImageResource(R.drawable.sat306);break;
                                        case 7:calendar_image.setImageResource(R.drawable.sat307);break;
                                        case 8:calendar_image.setImageResource(R.drawable.sat308);break;
                                        case 9:calendar_image.setImageResource(R.drawable.sat309);break;
                                    }break;
                            }
                        }

                        if (spinner2.getItemAtPosition(position).equals("12월")) {
                            calendar_print_123.setText("< 12월 달력 >");
                            calendar_print_123.setPaintFlags(calendar_print_123.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

                            int month_number = 12 + year_final2;

                            int month_final = month_number;
                            while (true) {

                                if (month_final < 10) {
                                    break;
                                } else {
                                    String e = Integer.toString(month_final);
                                    month_final = ((int) e.charAt(0) - 48) + ((int) e.charAt(1) - 48);
                                }
                            }
                            month_print.setText("<  1월수 (" + Integer.toString(month_final) + ")  >");
                            month_print.setPaintFlags(month_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

                            switch (month_final) {
                                case 1:
                                    month_number_print.setText(month_1);
                                    break;
                                case 2:
                                    month_number_print.setText(month_2);
                                    break;
                                case 3:
                                    month_number_print.setText(month_3);
                                    break;
                                case 4:
                                    month_number_print.setText(month_4);
                                    break;
                                case 5:
                                    month_number_print.setText(month_5);
                                    break;
                                case 6:
                                    month_number_print.setText(month_6);
                                    break;
                                case 7:
                                    month_number_print.setText(month_7);
                                    break;
                                case 8:
                                    month_number_print.setText(month_8);
                                    break;
                                case 9:
                                    month_number_print.setText(month_9);
                                    break;
                            }


                            int DECRESE_MONTH = -1;
                            int INCRESE_MONTH = +1;
                            int NOTHING_MONTH_MODE = 0;
                            int COUNT_DAY_NUMBER_IN_WEEK = 7;
                            int monthChangeType = 0;
                            int currentMonth;
                            int numberOfStartDate;
                            int numberOfEndDate;
                            int weekNumberInCurrentMonth;
                            Calendar cal;
                            int currentYear = Integer.parseInt(getCalendar);
                            currentMonth = 11;

                            cal = Calendar.getInstance();
                            cal.set(currentYear, currentMonth, 1);
                            if(monthChangeType == DECRESE_MONTH) cal.add(Calendar.MONTH, DECRESE_MONTH);
                            if(monthChangeType == INCRESE_MONTH) cal.add(Calendar.MONTH, INCRESE_MONTH);
                            numberOfStartDate = cal.get(Calendar.DAY_OF_WEEK);
                            numberOfEndDate = cal.getActualMaximum(Calendar.DATE);
                            cal.set(Calendar.DATE, numberOfEndDate);
                            weekNumberInCurrentMonth = cal.get(Calendar.WEEK_OF_MONTH);



                            String calendar2="  ";
                            int count=0;
                            int loopCount = COUNT_DAY_NUMBER_IN_WEEK * weekNumberInCurrentMonth;
                            for(int i=0, printDay=1; i<loopCount;i++) {
                                if(i < numberOfStartDate || printDay > numberOfEndDate)
                                    count+=1;
                            }

                            switch(count){
                                case 1:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.sun311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.sun312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.sun313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.sun314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.sun315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.sun316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.sun317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.sun318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.sun319);break;
                                    }break;
                                case 2:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.mon311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.mon312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.mon313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.mon314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.mon315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.mon316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.mon317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.mon318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.mon319);break;
                                    }break;
                                case 3:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.tue311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.tue312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.tue313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.tue314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.tue315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.tue316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.tue317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.tue318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.tue319);break;
                                    }break;
                                case 4:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.wed311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.wed312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.wed313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.wed314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.wed315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.wed316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.wed317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.wed318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.wed319);break;
                                    }break;
                                case 5:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.thu311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.thu312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.thu313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.thu314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.thu315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.thu316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.thu317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.thu318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.thu319);break;
                                    }break;
                                case 6:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.fir311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.fir312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.fir313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.fir314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.fir315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.fir316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.fir317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.fir318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.fir319);break;
                                    }break;
                                case 7:
                                    switch(month_final){
                                        case 1:calendar_image.setImageResource(R.drawable.sat311);break;
                                        case 2:calendar_image.setImageResource(R.drawable.sat312);break;
                                        case 3:calendar_image.setImageResource(R.drawable.sat313);break;
                                        case 4:calendar_image.setImageResource(R.drawable.sat314);break;
                                        case 5:calendar_image.setImageResource(R.drawable.sat315);break;
                                        case 6:calendar_image.setImageResource(R.drawable.sat316);break;
                                        case 7:calendar_image.setImageResource(R.drawable.sat317);break;
                                        case 8:calendar_image.setImageResource(R.drawable.sat318);break;
                                        case 9:calendar_image.setImageResource(R.drawable.sat319);break;
                                    }break;
                            }
                        }

                    }
                    @Override
                    public void onNothingSelected(AdapterView<?> parent) {}
                });
            }

            subi_print.setText("<  수비학  >");
            subi_print.setPaintFlags(subi_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

            age_print.setText("<  인생표  >");
            age_print.setPaintFlags(subi_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);

            calendar_print.setText("<  월 선택  >");
            calendar_print.setPaintFlags(subi_print.getPaintFlags() | Paint.FAKE_BOLD_TEXT_FLAG);
        }
    };
}
